arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
/* Copyright (c) 2009 Atmel Corporation
   All rights reserved.

   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:

   * Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.

   * Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in
     the documentation and/or other materials provided with the
     distribution.

   * Neither the name of the copyright holders nor the names of
     contributors may be used to endorse or promote products derived
     from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
  POSSIBILITY OF SUCH DAMAGE. */

/* $Id: iom128rfa1.h 2009 2009-07-01 14:57:41Z joerg_wunsch $ */

/* avr/iom128rfa1.h - definitions for ATmega128RFA1 */

#ifndef _AVR_IOM128RFA1_H_
#define _AVR_IOM128RFA1_H_ 1

/* This file should only be included from <avr/io.h>, never directly. */

#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "iom128rfa1.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#include <avr/sfr_defs.h>

#ifndef __ASSEMBLER__
#  define _MMIO_BYTE_STRUCT(mem_addr,type) (*(volatile type *)(mem_addr))
#  define _SFR_IO8_STRUCT(io_addr,type) _MMIO_BYTE_STRUCT((io_addr) + 0x20, type)
#  define _SFR_MEM8_STRUCT(io_addr,type) _MMIO_BYTE_STRUCT((io_addr), type)
#endif /* __ASSEMBLER__ */

/*
 * USAGE:
 *
 * simple register assignment:
 * TIFR1 = 0x17
 * subregister assignment:
 * TIFR1_struct.ocf1a = 1
 * (subregister names are converted to small letters)
 */


/* Port A Input Pins Address */
#define PINA                            _SFR_IO8(0x00)

  /* PINA */

#define PINA0                           0
#define PINA1                           1
#define PINA2                           2
#define PINA3                           3
#define PINA4                           4
#define PINA5                           5
#define PINA6                           6
#define PINA7                           7

/* Port A Data Direction Register */
#define DDRA                            _SFR_IO8(0x01)

  /* DDRA */

#define DDA0                            0
#define DDA1                            1
#define DDA2                            2
#define DDA3                            3
#define DDA4                            4
#define DDA5                            5
#define DDA6                            6
#define DDA7                            7

/* Port A Data Register */
#define PORTA                           _SFR_IO8(0x02)

  /* PORTA */

#define PORTA0                          0
#define PA0                             0
#define PORTA1                          1
#define PA1                             1
#define PORTA2                          2
#define PA2                             2
#define PORTA3                          3
#define PA3                             3
#define PORTA4                          4
#define PA4                             4
#define PORTA5                          5
#define PA5                             5
#define PORTA6                          6
#define PA6                             6
#define PORTA7                          7
#define PA7                             7

/* Port B Input Pins Address */
#define PINB                            _SFR_IO8(0x03)

  /* PINB */

#define PINB0                           0
#define PINB1                           1
#define PINB2                           2
#define PINB3                           3
#define PINB4                           4
#define PINB5                           5
#define PINB6                           6
#define PINB7                           7

/* Port B Data Direction Register */
#define DDRB                            _SFR_IO8(0x04)

  /* DDRB */

#define DDB0                            0
#define DDB1                            1
#define DDB2                            2
#define DDB3                            3
#define DDB4                            4
#define DDB5                            5
#define DDB6                            6
#define DDB7                            7

/* Port B Data Register */
#define PORTB                           _SFR_IO8(0x05)

  /* PORTB */

#define PORTB0                          0
#define PB0                             0
#define PORTB1                          1
#define PB1                             1
#define PORTB2                          2
#define PB2                             2
#define PORTB3                          3
#define PB3                             3
#define PORTB4                          4
#define PB4                             4
#define PORTB5                          5
#define PB5                             5
#define PORTB6                          6
#define PB6                             6
#define PORTB7                          7
#define PB7                             7

/* Port C Input Pins Address */
#define PINC                            _SFR_IO8(0x06)

  /* PINC */

#define PINC0                           0
#define PINC1                           1
#define PINC2                           2
#define PINC3                           3
#define PINC4                           4
#define PINC5                           5
#define PINC6                           6
#define PINC7                           7

