arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
/* Port C Data Direction Register */
#define DDRC                            _SFR_IO8(0x07)

  /* DDRC */

#define DDC0                            0
#define DDC1                            1
#define DDC2                            2
#define DDC3                            3
#define DDC4                            4
#define DDC5                            5
#define DDC6                            6
#define DDC7                            7

/* Port C Data Register */
#define PORTC                           _SFR_IO8(0x08)

  /* PORTC */

#define PORTC0                          0
#define PC0                             0
#define PORTC1                          1
#define PC1                             1
#define PORTC2                          2
#define PC2                             2
#define PORTC3                          3
#define PC3                             3
#define PORTC4                          4
#define PC4                             4
#define PORTC5                          5
#define PC5                             5
#define PORTC6                          6
#define PC6                             6
#define PORTC7                          7
#define PC7                             7

/* Port D Input Pins Address */
#define PIND                            _SFR_IO8(0x09)

  /* PIND */

#define PIND0                           0
#define PIND1                           1
#define PIND2                           2
#define PIND3                           3
#define PIND4                           4
#define PIND5                           5
#define PIND6                           6
#define PIND7                           7

/* Port D Data Direction Register */
#define DDRD                            _SFR_IO8(0x0A)

  /* DDRD */

#define DDD0                            0
#define DDD1                            1
#define DDD2                            2
#define DDD3                            3
#define DDD4                            4
#define DDD5                            5
#define DDD6                            6
#define DDD7                            7

/* Port D Data Register */
#define PORTD                           _SFR_IO8(0x0B)

  /* PORTD */

#define PORTD0                          0
#define PD0                             0
#define PORTD1                          1
#define PD1                             1
#define PORTD2                          2
#define PD2                             2
#define PORTD3                          3
#define PD3                             3
#define PORTD4                          4
#define PD4                             4
#define PORTD5                          5
#define PD5                             5
#define PORTD6                          6
#define PD6                             6
#define PORTD7                          7
#define PD7                             7

/* Port E Input Pins Address */
#define PINE                            _SFR_IO8(0x0C)

  /* PINE */

#define PINE0                           0
#define PINE1                           1
#define PINE2                           2
#define PINE3                           3
#define PINE4                           4
#define PINE5                           5
#define PINE6                           6
#define PINE7                           7

/* Port E Data Direction Register */
#define DDRE                            _SFR_IO8(0x0D)

  /* DDRE */

#define DDE0                            0
#define DDE1                            1
#define DDE2                            2
#define DDE3                            3
#define DDE4                            4
#define DDE5                            5
#define DDE6                            6
#define DDE7                            7

/* Port E Data Register */
#define PORTE                           _SFR_IO8(0x0E)

  /* PORTE */

#define PORTE0                          0
#define PE0                             0
#define PORTE1                          1
#define PE1                             1
#define PORTE2                          2
#define PE2                             2
#define PORTE3                          3
#define PE3                             3
#define PORTE4                          4
#define PE4                             4
#define PORTE5                          5
#define PE5                             5
#define PORTE6                          6
#define PE6                             6
#define PORTE7                          7
#define PE7                             7

/* Port F Input Pins Address */
#define PINF                            _SFR_IO8(0x0F)

  /* PINF */

#define PINF0                           0
#define PINF1                           1
#define PINF2                           2
#define PINF3                           3
#define PINF4                           4
#define PINF5                           5
#define PINF6                           6
#define PINF7                           7

/* Port F Data Direction Register */
#define DDRF                            _SFR_IO8(0x10)

  /* DDRF */

#define DDF0                            0
#define DDF1                            1
#define DDF2                            2
#define DDF3                            3
#define DDF4                            4
#define DDF5                            5
#define DDF6                            6
#define DDF7                            7

/* Port F Data Register */
#define PORTF                           _SFR_IO8(0x11)

  /* PORTF */

#define PORTF0                          0
#define PF0                             0
#define PORTF1                          1
#define PF1                             1
#define PORTF2                          2
#define PF2                             2
#define PORTF3                          3
#define PF3                             3
#define PORTF4                          4
#define PF4                             4
#define PORTF5                          5
#define PF5                             5
#define PORTF6                          6
#define PF6                             6
#define PORTF7                          7
#define PF7                             7

