arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
/* Port G Input Pins Address */
#define PING                            _SFR_IO8(0x12)

  /* PING */

#define PING0                           0
#define PING1                           1
#define PING2                           2
#define PING3                           3
#define PING4                           4
#define PING5                           5

/* Port G Data Direction Register */
#define DDRG                            _SFR_IO8(0x13)

  /* DDRG */

#define DDG0                            0
#define DDG1                            1
#define DDG2                            2
#define DDG3                            3
#define DDG4                            4
#define DDG5                            5

/* Port G Data Register */
#define PORTG                           _SFR_IO8(0x14)

  /* PORTG */

#define PORTG0                          0
#define PG0                             0
#define PORTG1                          1
#define PG1                             1
#define PORTG2                          2
#define PG2                             2
#define PORTG3                          3
#define PG3                             3
#define PORTG4                          4
#define PG4                             4
#define PORTG5                          5
#define PG5                             5

/* Timer/Counter0 Interrupt Flag Register */
#define TIFR0                           _SFR_IO8(0x15)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIFR0 {
        unsigned int tov0 : 1;	/* Timer/Counter0 Overflow Flag */
        unsigned int ocf0a : 1;	/* Timer/Counter0 Output Compare A Match Flag */
        unsigned int ocf0b : 1;	/* Timer/Counter0 Output Compare B Match Flag */
        unsigned int : 5;
};

#define TIFR0_struct _SFR_IO8_STRUCT(0x15, struct __reg_TIFR0)

#endif /* __ASSEMBLER__ */

  /* TIFR0 */

#define TOV0                            0
#define OCF0A                           1
#define OCF0B                           2

/* Timer/Counter1 Interrupt Flag Register */
#define TIFR1                           _SFR_IO8(0x16)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIFR1 {
        unsigned int tov1 : 1;	/* Timer/Counter1 Overflow Flag */
        unsigned int ocf1a : 1;	/* Timer/Counter1 Output Compare A Match Flag */
        unsigned int ocf1b : 1;	/* Timer/Counter1 Output Compare B Match Flag */
        unsigned int ocf1c : 1;	/* Timer/Counter1 Output Compare C Match Flag */
        unsigned int : 1;
        unsigned int icf1 : 1;	/* Timer/Counter1 Input Capture Flag */
        unsigned int : 2;
};

#define TIFR1_struct _SFR_IO8_STRUCT(0x16, struct __reg_TIFR1)

#endif /* __ASSEMBLER__ */

  /* TIFR1 */

#define TOV1                            0
#define OCF1A                           1
#define OCF1B                           2
#define OCF1C                           3
#define ICF1                            5

/* Timer/Counter Interrupt Flag Register */
#define TIFR2                           _SFR_IO8(0x17)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIFR2 {
        unsigned int tov2 : 1;	/* Timer/Counter2 Overflow Flag */
        unsigned int ocf2a : 1;	/* Output Compare Flag 2 A */
        unsigned int ocf2b : 1;	/* Output Compare Flag 2 B */
        unsigned int : 5;
};

#define TIFR2_struct _SFR_IO8_STRUCT(0x17, struct __reg_TIFR2)

#endif /* __ASSEMBLER__ */

  /* TIFR2 */

#define TOV2                            0
#define OCF2A                           1
#define OCF2B                           2

/* Timer/Counter3 Interrupt Flag Register */
#define TIFR3                           _SFR_IO8(0x18)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIFR3 {
        unsigned int tov3 : 1;	/* Timer/Counter3 Overflow Flag */
        unsigned int ocf3a : 1;	/* Timer/Counter3 Output Compare A Match Flag */
        unsigned int ocf3b : 1;	/* Timer/Counter3 Output Compare B Match Flag */
        unsigned int ocf3c : 1;	/* Timer/Counter3 Output Compare C Match Flag */
        unsigned int : 1;
        unsigned int icf3 : 1;	/* Timer/Counter3 Input Capture Flag */
        unsigned int : 2;
};

#define TIFR3_struct _SFR_IO8_STRUCT(0x18, struct __reg_TIFR3)

#endif /* __ASSEMBLER__ */

  /* TIFR3 */

#define TOV3                            0
#define OCF3A                           1
#define OCF3B                           2
#define OCF3C                           3
#define ICF3                            5

/* Timer/Counter4 Interrupt Flag Register */
#define TIFR4                           _SFR_IO8(0x19)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIFR4 {
        unsigned int tov4 : 1;	/* Timer/Counter4 Overflow Flag */
        unsigned int ocf4a : 1;	/* Timer/Counter4 Output Compare A Match Flag */
        unsigned int ocf4b : 1;	/* Timer/Counter4 Output Compare B Match Flag */
        unsigned int ocf4c : 1;	/* Timer/Counter4 Output Compare C Match Flag */
        unsigned int : 1;
        unsigned int icf4 : 1;	/* Timer/Counter4 Input Capture Flag */
        unsigned int : 2;
};

#define TIFR4_struct _SFR_IO8_STRUCT(0x19, struct __reg_TIFR4)

#endif /* __ASSEMBLER__ */

  /* TIFR4 */

#define TOV4                            0
#define OCF4A                           1
#define OCF4B                           2
#define OCF4C                           3
#define ICF4                            5

/* Timer/Counter5 Interrupt Flag Register */
#define TIFR5                           _SFR_IO8(0x1A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIFR5 {
        unsigned int tov5 : 1;	/* Timer/Counter5 Overflow Flag */
        unsigned int ocf5a : 1;	/* Timer/Counter5 Output Compare A Match Flag */
        unsigned int ocf5b : 1;	/* Timer/Counter5 Output Compare B Match Flag */
        unsigned int ocf5c : 1;	/* Timer/Counter5 Output Compare C Match Flag */
        unsigned int : 1;
        unsigned int icf5 : 1;	/* Timer/Counter5 Input Capture Flag */
        unsigned int : 2;
};

#define TIFR5_struct _SFR_IO8_STRUCT(0x1a, struct __reg_TIFR5)

