arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* TIFR5 */

#define TOV5                            0
#define OCF5A                           1
#define OCF5B                           2
#define OCF5C                           3
#define ICF5                            5

/* Pin Change Interrupt Flag Register */
#define PCIFR                           _SFR_IO8(0x1B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PCIFR {
        unsigned int pcif : 3;	/* Pin Change Interrupt Flag 2 */
        unsigned int : 5;
};

#define PCIFR_struct _SFR_IO8_STRUCT(0x1b, struct __reg_PCIFR)

#endif /* __ASSEMBLER__ */

  /* PCIFR */

#define PCIF0                           0
#define PCIF1                           1
#define PCIF2                           2

/* External Interrupt Flag Register */
#define EIFR                            _SFR_IO8(0x1C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_EIFR {
        unsigned int intf : 8;	/* External Interrupt Flag */
};

#define EIFR_struct _SFR_IO8_STRUCT(0x1c, struct __reg_EIFR)

#endif /* __ASSEMBLER__ */

  /* EIFR */

#define INTF0                           0
#define INTF1                           1
#define INTF2                           2
#define INTF3                           3
#define INTF4                           4
#define INTF5                           5
#define INTF6                           6
#define INTF7                           7

/* External Interrupt Mask Register */
#define EIMSK                           _SFR_IO8(0x1D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_EIMSK {
        unsigned int intm : 8;	/* External Interrupt Request Enable */
};

#define EIMSK_struct _SFR_IO8_STRUCT(0x1d, struct __reg_EIMSK)

#endif /* __ASSEMBLER__ */

  /* EIMSK */

#define INT0                            0
#define INT1                            1
#define INT2                            2
#define INT3                            3
#define INT4                            4
#define INT5                            5
#define INT6                            6
#define INT7                            7

/* General Purpose IO Register 0 */
#define GPIOR0                          _SFR_IO8(0x1E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_GPIOR0 {
        unsigned int gpior0 : 8;	/* General Purpose I/O Register 0 Value */
};

#define GPIOR0_struct _SFR_IO8_STRUCT(0x1e, struct __reg_GPIOR0)

#endif /* __ASSEMBLER__ */

  /* GPIOR0 */

#define GPIOR00                         0
#define GPIOR01                         1
#define GPIOR02                         2
#define GPIOR03                         3
#define GPIOR04                         4
#define GPIOR05                         5
#define GPIOR06                         6
#define GPIOR07                         7

/* 6-char sequence denoting where to find the EEPROM registers in memory space.
   Adresses denoted in hex syntax with uppercase letters. Used by the EEPROM
   subroutines.
   First two letters:  EECR address.
   Second two letters: EEDR address.
   Last two letters:   EEAR address.  */

#define __EEPROM_REG_LOCATIONS__ 1F2021

/* EEPROM Control Register */
#define EECR                            _SFR_IO8(0x1F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_EECR {
        unsigned int eere : 1;	/* EEPROM Read Enable */
        unsigned int eepe : 1;	/* EEPROM Programming Enable */
        unsigned int eempe : 1;	/* EEPROM Master Write Enable */
        unsigned int eerie : 1;	/* EEPROM Ready Interrupt Enable */
        unsigned int eepm : 2;	/* EEPROM Programming Mode */
        unsigned int : 2;
};

#define EECR_struct _SFR_IO8_STRUCT(0x1f, struct __reg_EECR)

#endif /* __ASSEMBLER__ */

  /* EECR */

#define EERE                            0
#define EEPE                            1
#define EEMPE                           2
#define EERIE                           3
#define EEPM0                           4
#define EEPM1                           5

/* EEPROM Data Register */
#define EEDR                            _SFR_IO8(0x20)

  /* EEDR */

#define EEDR0                           0
#define EEDR1                           1
#define EEDR2                           2
#define EEDR3                           3
#define EEDR4                           4
#define EEDR5                           5
#define EEDR6                           6
#define EEDR7                           7

/* EEPROM Address Register  Bytes */
#define EEAR                            _SFR_IO16(0x21)
#define EEARL                           _SFR_IO8(0x21)
#define EEARH                           _SFR_IO8(0x22)

/* General Timer/Counter Control Register */
#define GTCCR                           _SFR_IO8(0x23)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_GTCCR {
        unsigned int psrsync : 1;	/* Prescaler Reset for Synchronous Timer/Counters */
        unsigned int psrasy : 1;	/* Prescaler Reset Timer/Counter2 */
        unsigned int : 5;
        unsigned int tsm : 1;	/* Timer/Counter Synchronization Mode */
};

#define GTCCR_struct _SFR_IO8_STRUCT(0x23, struct __reg_GTCCR)

#endif /* __ASSEMBLER__ */

  /* GTCCR */

#define PSRSYNC                         0
#define PSR10                           0
#define PSRASY                          1
#define PSR2                            1
#define TSM                             7

/* Timer/Counter0 Control Register A */
#define TCCR0A                          _SFR_IO8(0x24)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR0A {
        unsigned int wgm0 : 2;	/* Waveform Generation Mode */
        unsigned int : 2;
        unsigned int com0b : 2;	/* Compare Match Output B Mode */
        unsigned int com0a : 2;	/* Compare Match Output A Mode */
};

#define TCCR0A_struct _SFR_IO8_STRUCT(0x24, struct __reg_TCCR0A)

