arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* TCCR0A */

#define WGM00                           0
#define WGM01                           1
#define COM0B0                          4
#define COM0B1                          5
#define COM0A0                          6
#define COM0A1                          7

/* Timer/Counter0 Control Register B */
#define TCCR0B                          _SFR_IO8(0x25)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR0B {
        unsigned int cs0 : 3;	/* Clock Select */
        unsigned int wgm02 : 1;	/*  */
        unsigned int : 2;
        unsigned int foc0b : 1;	/* Force Output Compare B */
        unsigned int foc0a : 1;	/* Force Output Compare A */
};

#define TCCR0B_struct _SFR_IO8_STRUCT(0x25, struct __reg_TCCR0B)

#endif /* __ASSEMBLER__ */

  /* TCCR0B */

#define CS00                            0
#define CS01                            1
#define CS02                            2
#define WGM02                           3
#define FOC0B                           6
#define FOC0A                           7

/* Timer/Counter0 Register */
#define TCNT0                           _SFR_IO8(0x26)

  /* TCNT0 */

#define TCNT0_0                         0
#define TCNT0_1                         1
#define TCNT0_2                         2
#define TCNT0_3                         3
#define TCNT0_4                         4
#define TCNT0_5                         5
#define TCNT0_6                         6
#define TCNT0_7                         7

/* Timer/Counter0 Output Compare Register */
#define OCR0A                           _SFR_IO8(0x27)

  /* OCR0A */

#define OCR0A_0                         0
#define OCR0A_1                         1
#define OCR0A_2                         2
#define OCR0A_3                         3
#define OCR0A_4                         4
#define OCR0A_5                         5
#define OCR0A_6                         6
#define OCR0A_7                         7

/* Timer/Counter0 Output Compare Register B */
#define OCR0B                           _SFR_IO8(0x28)

  /* OCR0B */

#define OCR0B_0                         0
#define OCR0B_1                         1
#define OCR0B_2                         2
#define OCR0B_3                         3
#define OCR0B_4                         4
#define OCR0B_5                         5
#define OCR0B_6                         6
#define OCR0B_7                         7

/* General Purpose IO Register 1 */
#define GPIOR1                          _SFR_IO8(0x2A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_GPIOR1 {
        unsigned int gpior1 : 8;	/* General Purpose I/O Register 1 Value */
};

#define GPIOR1_struct _SFR_IO8_STRUCT(0x2a, struct __reg_GPIOR1)

#endif /* __ASSEMBLER__ */

  /* GPIOR1 */

#define GPIOR10                         0
#define GPIOR11                         1
#define GPIOR12                         2
#define GPIOR13                         3
#define GPIOR14                         4
#define GPIOR15                         5
#define GPIOR16                         6
#define GPIOR17                         7

/* General Purpose I/O Register 2 */
#define GPIOR2                          _SFR_IO8(0x2B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_GPIOR2 {
        unsigned int gpior2 : 8;	/* General Purpose I/O Register 2 Value */
};

#define GPIOR2_struct _SFR_IO8_STRUCT(0x2b, struct __reg_GPIOR2)

#endif /* __ASSEMBLER__ */

  /* GPIOR2 */

#define GPIOR20                         0
#define GPIOR21                         1
#define GPIOR22                         2
#define GPIOR23                         3
#define GPIOR24                         4
#define GPIOR25                         5
#define GPIOR26                         6
#define GPIOR27                         7

/* SPI Control Register */
#define SPCR                            _SFR_IO8(0x2C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SPCR {
        unsigned int spr : 2;	/* SPI Clock Rate Select 1 and 0 */
        unsigned int cpha : 1;	/* Clock Phase */
        unsigned int cpol : 1;	/* Clock polarity */
        unsigned int mstr : 1;	/* Master/Slave Select */
        unsigned int dord : 1;	/* Data Order */
        unsigned int spe : 1;	/* SPI Enable */
        unsigned int spie : 1;	/* SPI Interrupt Enable */
};

#define SPCR_struct _SFR_IO8_STRUCT(0x2c, struct __reg_SPCR)

#endif /* __ASSEMBLER__ */

  /* SPCR */

#define SPR0                            0
#define SPR1                            1
#define CPHA                            2
#define CPOL                            3
#define MSTR                            4
#define DORD                            5
#define SPE                             6
#define SPIE                            7

/* SPI Status Register */
#define SPSR                            _SFR_IO8(0x2D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SPSR {
        unsigned int spi2x : 1;	/* Double SPI Speed Bit */
        unsigned int : 5;
        unsigned int wcol : 1;	/* Write Collision Flag */
        unsigned int spif : 1;	/* SPI Interrupt Flag */
};

#define SPSR_struct _SFR_IO8_STRUCT(0x2d, struct __reg_SPSR)

#endif /* __ASSEMBLER__ */

  /* SPSR */

#define SPI2X                           0
#define WCOL                            6
#define SPIF                            7

/* SPI Data Register */
#define SPDR                            _SFR_IO8(0x2E)

  /* SPDR */

#define SPDR0                           0
#define SPDR1                           1
#define SPDR2                           2
#define SPDR3                           3
#define SPDR4                           4
#define SPDR5                           5
#define SPDR6                           6
#define SPDR7                           7

/* Analog Comparator Control And Status Register */
#define ACSR                            _SFR_IO8(0x30)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ACSR {
        unsigned int acis : 2;	/* Analog Comparator Interrupt Mode Select */
        unsigned int acic : 1;	/* Analog Comparator Input Capture Enable */
        unsigned int acie : 1;	/* Analog Comparator Interrupt Enable */
        unsigned int aci : 1;	/* Analog Comparator Interrupt Flag */
        unsigned int aco : 1;	/* Analog Compare Output */
        unsigned int acbg : 1;	/* Analog Comparator Bandgap Select */
        unsigned int acd : 1;	/* Analog Comparator Disable */
};

#define ACSR_struct _SFR_IO8_STRUCT(0x30, struct __reg_ACSR)

