arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* ACSR */

#define ACIS0                           0
#define ACIS1                           1
#define ACIC                            2
#define ACIE                            3
#define ACI                             4
#define ACO                             5
#define ACBG                            6
#define ACD                             7

/* On-Chip Debug Register */
#define OCDR                            _SFR_IO8(0x31)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_OCDR {
        unsigned int ocdr : 8;	/* On-Chip Debug Register Data */
};

#define OCDR_struct _SFR_IO8_STRUCT(0x31, struct __reg_OCDR)

#endif /* __ASSEMBLER__ */

  /* OCDR */

#define OCDR0                           0
#define OCDR1                           1
#define OCDR2                           2
#define OCDR3                           3
#define OCDR4                           4
#define OCDR5                           5
#define OCDR6                           6
#define OCDR7                           7
#define IDRD                            7

/* Sleep Mode Control Register */
#define SMCR                            _SFR_IO8(0x33)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SMCR {
        unsigned int se : 1;	/* Sleep Enable */
        unsigned int sm : 3;	/* Sleep Mode Select bits */
        unsigned int : 4;
};

#define SMCR_struct _SFR_IO8_STRUCT(0x33, struct __reg_SMCR)

#endif /* __ASSEMBLER__ */

  /* SMCR */

#define SE                              0
#define SM0                             1
#define SM1                             2
#define SM2                             3

/* MCU Status Register */
#define MCUSR                           _SFR_IO8(0x34)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_MCUSR {
        unsigned int porf : 1;	/* Power-on Reset Flag */
        unsigned int extrf : 1;	/* External Reset Flag */
        unsigned int borf : 1;	/* Brown-out Reset Flag */
        unsigned int wdrf : 1;	/* Watchdog Reset Flag */
        unsigned int jtrf : 1;	/* JTAG Reset Flag */
        unsigned int : 3;
};

#define MCUSR_struct _SFR_IO8_STRUCT(0x34, struct __reg_MCUSR)

#endif /* __ASSEMBLER__ */

  /* MCUSR */

#define PORF                            0
#define EXTRF                           1
#define BORF                            2
#define WDRF                            3
#define JTRF                            4

/* MCU Control Register */
#define MCUCR                           _SFR_IO8(0x35)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_MCUCR {
        unsigned int ivce : 1;	/* Interrupt Vector Change Enable */
        unsigned int ivsel : 1;	/* Interrupt Vector Select */
        unsigned int : 2;
        unsigned int pud : 1;	/* Pull-up Disable */
        unsigned int : 2;
        unsigned int jtd : 1;	/* JTAG Interface Disable */
};

#define MCUCR_struct _SFR_IO8_STRUCT(0x35, struct __reg_MCUCR)

#endif /* __ASSEMBLER__ */

  /* MCUCR */

#define IVCE                            0
#define IVSEL                           1
#define PUD                             4
#define JTD                             7

/* Store Program Memory Control Register */
#define SPMCSR                          _SFR_IO8(0x37)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SPMCSR {
        unsigned int spmen : 1;	/* Store Program Memory Enable */
        unsigned int pgers : 1;	/* Page Erase */
        unsigned int pgwrt : 1;	/* Page Write */
        unsigned int blbset : 1;	/* Boot Lock Bit Set */
        unsigned int rwwsre : 1;	/* Read While Write Section Read Enable */
        unsigned int sigrd : 1;	/* Signature Row Read */
        unsigned int rwwsb : 1;	/* Read While Write Section Busy */
        unsigned int spmie : 1;	/* SPM Interrupt Enable */
};

#define SPMCSR_struct _SFR_IO8_STRUCT(0x37, struct __reg_SPMCSR)

#endif /* __ASSEMBLER__ */

  /* SPMCSR */

#define SPMEN                           0
#define PGERS                           1
#define PGWRT                           2
#define BLBSET                          3
#define RWWSRE                          4
#define SIGRD                           5
#define RWWSB                           6
#define SPMIE                           7

/* Extended Z-pointer Register for ELPM/SPM */
#define RAMPZ                           _SFR_IO8(0x3B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_RAMPZ {
        unsigned int rampz : 2;	/* Extended Z-Pointer Value */
        unsigned int : 6;
};

#define RAMPZ_struct _SFR_IO8_STRUCT(0x3b, struct __reg_RAMPZ)

#endif /* __ASSEMBLER__ */

  /* RAMPZ */

#define RAMPZ0                          0
#define RAMPZ1                          1

/* Stack Pointer */
#define SP                              _SFR_IO16(0x3D)
#define SPL                             _SFR_IO8(0x3D)
#define SPH                             _SFR_IO8(0x3E)

/* Status Register */
#define SREG                            _SFR_IO8(0x3F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SREG {
        unsigned int c : 1;	/* Carry Flag */
        unsigned int z : 1;	/* Zero Flag */
        unsigned int n : 1;	/* Negative Flag */
        unsigned int v : 1;	/* Two's Complement Overflow Flag */
        unsigned int s : 1;	/* Sign Bit */
        unsigned int h : 1;	/* Half Carry Flag */
        unsigned int t : 1;	/* Bit Copy Storage */
        unsigned int i : 1;	/* Global Interrupt Enable */
};

#define SREG_struct _SFR_IO8_STRUCT(0x3f, struct __reg_SREG)

#endif /* __ASSEMBLER__ */

  /* SREG */

#define SREG_C                          0
#define SREG_Z                          1
#define SREG_N                          2
#define SREG_V                          3
#define SREG_S                          4
#define SREG_H                          5
#define SREG_T                          6
#define SREG_I                          7

/* Watchdog Timer Control Register */
#define WDTCSR                          _SFR_MEM8(0x60)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_WDTCSR {
        unsigned int wdp : 3;	/* Watchdog Timer Prescaler bits */
        unsigned int wde : 1;	/* Watch Dog Enable */
        unsigned int wdce : 1;	/* Watchdog Change Enable */
        unsigned int : 1;
        unsigned int wdie : 1;	/* Watchdog Timeout Interrupt Enable */
        unsigned int wdif : 1;	/* Watchdog Timeout Interrupt Flag */
};

#define WDTCSR_struct _SFR_MEM8_STRUCT(0x60, struct __reg_WDTCSR)

