arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* WDTCSR */

#define WDP0                            0
#define WDP1                            1
#define WDP2                            2
#define WDE                             3
#define WDCE                            4
#define WDP3                            5
#define WDIE                            6
#define WDIF                            7

/* Clock Prescale Register */
#define CLKPR                           _SFR_MEM8(0x61)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_CLKPR {
        unsigned int clkps : 4;	/* Clock Prescaler Select Bits */
        unsigned int : 3;
        unsigned int clkpce : 1;	/* Clock Prescaler Change Enable */
};

#define CLKPR_struct _SFR_MEM8_STRUCT(0x61, struct __reg_CLKPR)

#endif /* __ASSEMBLER__ */

  /* CLKPR */

#define CLKPS0                          0
#define CLKPS1                          1
#define CLKPS2                          2
#define CLKPS3                          3
#define CLKPCE                          7

/* Power Reduction Register 2 */
#define PRR2                            _SFR_MEM8(0x63)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PRR2 {
        unsigned int prram : 4;	/* Power Reduction SRAM 3 */
        unsigned int : 4;
};

#define PRR2_struct _SFR_MEM8_STRUCT(0x63, struct __reg_PRR2)

#endif /* __ASSEMBLER__ */

  /* PRR2 */

#define PRRAM0                          0
#define PRRAM1                          1
#define PRRAM2                          2
#define PRRAM3                          3

#define __AVR_HAVE_PRR2	((1<<PRRAM0)|(1<<PRRAM1)|(1<<PRRAM2)|(1<<PRRAM3))
#define __AVR_HAVE_PRR2_PRRAM0
#define __AVR_HAVE_PRR2_PRRAM1
#define __AVR_HAVE_PRR2_PRRAM2
#define __AVR_HAVE_PRR2_PRRAM3

/* Power Reduction Register0 */
#define PRR0                            _SFR_MEM8(0x64)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PRR0 {
        unsigned int pradc : 1;	/* Power Reduction ADC */
        unsigned int prusart0 : 1;	/* Power Reduction USART */
        unsigned int prspi : 1;	/* Power Reduction Serial Peripheral Interface */
        unsigned int prtim1 : 1;	/* Power Reduction Timer/Counter1 */
        unsigned int prpga : 1;	/* Power Reduction PGA */
        unsigned int prtim0 : 1;	/* Power Reduction Timer/Counter0 */
        unsigned int prtim2 : 1;	/* Power Reduction Timer/Counter2 */
        unsigned int prtwi : 1;	/* Power Reduction TWI */
};

#define PRR0_struct _SFR_MEM8_STRUCT(0x64, struct __reg_PRR0)

#endif /* __ASSEMBLER__ */

  /* PRR0 */

#define PRADC                           0
#define PRUSART0                        1
#define PRSPI                           2
#define PRTIM1                          3
#define PRPGA                           4
#define PRTIM0                          5
#define PRTIM2                          6
#define PRTWI                           7

#define __AVR_HAVE_PRR0	((1<<PRADC)|(1<<PRUSART0)|(1<<PRSPI)|(1<<PRTIM1)|(1<<PRPGA)|(1<<PRTIM0)|(1<<PRTIM2)|(1<<PRTWI))
#define __AVR_HAVE_PRR0_PRADC
#define __AVR_HAVE_PRR0_PRUSART0
#define __AVR_HAVE_PRR0_PRSPI
#define __AVR_HAVE_PRR0_PRTIM1
#define __AVR_HAVE_PRR0_PRPGA
#define __AVR_HAVE_PRR0_PRTIM0
#define __AVR_HAVE_PRR0_PRTIM2
#define __AVR_HAVE_PRR0_PRTWI

/* Power Reduction Register 1 */
#define PRR1                            _SFR_MEM8(0x65)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PRR1 {
        unsigned int prusart : 3;	/* Reserved */
        unsigned int prtim3 : 1;	/* Power Reduction Timer/Counter3 */
        unsigned int prtim4 : 1;	/* Power Reduction Timer/Counter4 */
        unsigned int prtim5 : 1;	/* Power Reduction Timer/Counter5 */
        unsigned int prtrx24 : 1;	/* Power Reduction Transceiver */
        unsigned int : 1;
};

#define PRR1_struct _SFR_MEM8_STRUCT(0x65, struct __reg_PRR1)

#endif /* __ASSEMBLER__ */

  /* PRR1 */

#define PRUSART1                        0
#define PRUSART2                        1
#define PRUSART3                        2
#define PRTIM3                          3
#define PRTIM4                          4
#define PRTIM5                          5
#define PRTRX24                         6

#define __AVR_HAVE_PRR1	((1<<PRUSART1)|(1<<PRUSART2)|(1<<PRUSART3)|(1<<PRTIM3)|(1<<PRTIM4)|(1<<PRTIM5)|(1<<PRTRX24))
#define __AVR_HAVE_PRR1_PRUSART1
#define __AVR_HAVE_PRR1_PRUSART2
#define __AVR_HAVE_PRR1_PRUSART3
#define __AVR_HAVE_PRR1_PRTIM3
#define __AVR_HAVE_PRR1_PRTIM4
#define __AVR_HAVE_PRR1_PRTIM5
#define __AVR_HAVE_PRR1_PRTRX24

/* Oscillator Calibration Value */
#define OSCCAL                          _SFR_MEM8(0x66)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_OSCCAL {
        unsigned int cal : 8;	/* Oscillator Calibration Tuning Value */
};

#define OSCCAL_struct _SFR_MEM8_STRUCT(0x66, struct __reg_OSCCAL)

#endif /* __ASSEMBLER__ */

  /* OSCCAL */

#define CAL0                            0
#define CAL1                            1
#define CAL2                            2
#define CAL3                            3
#define CAL4                            4
#define CAL5                            5
#define CAL6                            6
#define CAL7                            7

/* Reference Voltage Calibration Register */
#define BGCR                            _SFR_MEM8(0x67)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_BGCR {
        unsigned int bgcal : 3;	/* Coarse Calibration Bits */
        unsigned int bgcal_fine : 4;	/* Fine Calibration Bits */
        unsigned int : 1;
};

#define BGCR_struct _SFR_MEM8_STRUCT(0x67, struct __reg_BGCR)

#endif /* __ASSEMBLER__ */

  /* BGCR */

#define BGCAL0                          0
#define BGCAL1                          1
#define BGCAL2                          2
#define BGCAL_FINE0                     3
#define BGCAL_FINE1                     4
#define BGCAL_FINE2                     5
#define BGCAL_FINE3                     6

/* Pin Change Interrupt Control Register */
#define PCICR                           _SFR_MEM8(0x68)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PCICR {
        unsigned int pcie : 3;	/* Pin Change Interrupt Enable 2 */
        unsigned int : 5;
};

#define PCICR_struct _SFR_MEM8_STRUCT(0x68, struct __reg_PCICR)

