arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* PCICR */

#define PCIE0                           0
#define PCIE1                           1
#define PCIE2                           2

/* External Interrupt Control Register A */
#define EICRA                           _SFR_MEM8(0x69)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_EICRA {
        unsigned int isc0 : 2;	/* External Interrupt 0 Sense Control Bit */
        unsigned int isc1 : 2;	/* External Interrupt 1 Sense Control Bit */
        unsigned int isc2 : 2;	/* External Interrupt 2 Sense Control Bit */
        unsigned int isc3 : 2;	/* External Interrupt 3 Sense Control Bit */
};

#define EICRA_struct _SFR_MEM8_STRUCT(0x69, struct __reg_EICRA)

#endif /* __ASSEMBLER__ */

  /* EICRA */

#define ISC00                           0
#define ISC01                           1
#define ISC10                           2
#define ISC11                           3
#define ISC20                           4
#define ISC21                           5
#define ISC30                           6
#define ISC31                           7

/* External Interrupt Control Register B */
#define EICRB                           _SFR_MEM8(0x6A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_EICRB {
        unsigned int isc4 : 2;	/* External Interrupt 4 Sense Control Bit */
        unsigned int isc5 : 2;	/* External Interrupt 5 Sense Control Bit */
        unsigned int isc6 : 2;	/* External Interrupt 6 Sense Control Bit */
        unsigned int isc7 : 2;	/* External Interrupt 7 Sense Control Bit */
};

#define EICRB_struct _SFR_MEM8_STRUCT(0x6a, struct __reg_EICRB)

#endif /* __ASSEMBLER__ */

  /* EICRB */

#define ISC40                           0
#define ISC41                           1
#define ISC50                           2
#define ISC51                           3
#define ISC60                           4
#define ISC61                           5
#define ISC70                           6
#define ISC71                           7

/* Pin Change Mask Register 0 */
#define PCMSK0                          _SFR_MEM8(0x6B)

  /* PCMSK0 */

#define PCINT0                          0
#define PCINT1                          1
#define PCINT2                          2
#define PCINT3                          3
#define PCINT4                          4
#define PCINT5                          5
#define PCINT6                          6
#define PCINT7                          7

/* Pin Change Mask Register 1 */
#define PCMSK1                          _SFR_MEM8(0x6C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PCMSK1 {
        unsigned int pcint : 2;	/* Pin Change Enable Mask */
        unsigned int pcint1 : 6;	/* Pin Change Enable Mask */
};

#define PCMSK1_struct _SFR_MEM8_STRUCT(0x6c, struct __reg_PCMSK1)

#endif /* __ASSEMBLER__ */

  /* PCMSK1 */

#define PCINT8                          0
#define PCINT9                          1
#define PCINT10                         2
#define PCINT11                         3
#define PCINT12                         4
#define PCINT13                         5
#define PCINT14                         6
#define PCINT15                         7

/* Pin Change Mask Register 2 */
#define PCMSK2                          _SFR_MEM8(0x6D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PCMSK2 {
        unsigned int pcint1 : 4;	/* Pin Change Enable Mask */
        unsigned int pcint2 : 4;	/* Pin Change Enable Mask */
};

#define PCMSK2_struct _SFR_MEM8_STRUCT(0x6d, struct __reg_PCMSK2)

#endif /* __ASSEMBLER__ */

  /* PCMSK2 */

#define PCINT16                         0
#define PCINT17                         1
#define PCINT18                         2
#define PCINT19                         3
#define PCINT20                         4
#define PCINT21                         5
#define PCINT22                         6
#define PCINT23                         7

/* Timer/Counter0 Interrupt Mask Register */
#define TIMSK0                          _SFR_MEM8(0x6E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIMSK0 {
        unsigned int toie0 : 1;	/* Timer/Counter0 Overflow Interrupt Enable */
        unsigned int ocie0a : 1;	/* Timer/Counter0 Output Compare Match A Interrupt Enable */
        unsigned int ocie0b : 1;	/* Timer/Counter0 Output Compare Match B Interrupt Enable */
        unsigned int : 5;
};

#define TIMSK0_struct _SFR_MEM8_STRUCT(0x6e, struct __reg_TIMSK0)

#endif /* __ASSEMBLER__ */

  /* TIMSK0 */

#define TOIE0                           0
#define OCIE0A                          1
#define OCIE0B                          2

/* Timer/Counter1 Interrupt Mask Register */
#define TIMSK1                          _SFR_MEM8(0x6F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIMSK1 {
        unsigned int toie1 : 1;	/* Timer/Counter1 Overflow Interrupt Enable */
        unsigned int ocie1a : 1;	/* Timer/Counter1 Output Compare A Match Interrupt Enable */
        unsigned int ocie1b : 1;	/* Timer/Counter1 Output Compare B Match Interrupt Enable */
        unsigned int ocie1c : 1;	/* Timer/Counter1 Output Compare C Match Interrupt Enable */
        unsigned int : 1;
        unsigned int icie1 : 1;	/* Timer/Counter1 Input Capture Interrupt Enable */
        unsigned int : 2;
};

#define TIMSK1_struct _SFR_MEM8_STRUCT(0x6f, struct __reg_TIMSK1)

#endif /* __ASSEMBLER__ */

  /* TIMSK1 */

#define TOIE1                           0
#define OCIE1A                          1
#define OCIE1B                          2
#define OCIE1C                          3
#define ICIE1                           5

/* Timer/Counter Interrupt Mask register */
#define TIMSK2                          _SFR_MEM8(0x70)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIMSK2 {
        unsigned int toie2 : 1;	/* Timer/Counter2 Overflow Interrupt Enable */
        unsigned int ocie2a : 1;	/* Timer/Counter2 Output Compare Match A Interrupt Enable */
        unsigned int ocie2b : 1;	/* Timer/Counter2 Output Compare Match B Interrupt Enable */
        unsigned int : 5;
};

#define TIMSK2_struct _SFR_MEM8_STRUCT(0x70, struct __reg_TIMSK2)

