arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* TIMSK2 */

#define TOIE2                           0
#define TOIE2A                          0
#define OCIE2A                          1
#define OCIE2B                          2

/* Timer/Counter3 Interrupt Mask Register */
#define TIMSK3                          _SFR_MEM8(0x71)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIMSK3 {
        unsigned int toie3 : 1;	/* Timer/Counter3 Overflow Interrupt Enable */
        unsigned int ocie3a : 1;	/* Timer/Counter3 Output Compare A Match Interrupt Enable */
        unsigned int ocie3b : 1;	/* Timer/Counter3 Output Compare B Match Interrupt Enable */
        unsigned int ocie3c : 1;	/* Timer/Counter3 Output Compare C Match Interrupt Enable */
        unsigned int : 1;
        unsigned int icie3 : 1;	/* Timer/Counter3 Input Capture Interrupt Enable */
        unsigned int : 2;
};

#define TIMSK3_struct _SFR_MEM8_STRUCT(0x71, struct __reg_TIMSK3)

#endif /* __ASSEMBLER__ */

  /* TIMSK3 */

#define TOIE3                           0
#define OCIE3A                          1
#define OCIE3B                          2
#define OCIE3C                          3
#define ICIE3                           5

/* Timer/Counter4 Interrupt Mask Register */
#define TIMSK4                          _SFR_MEM8(0x72)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIMSK4 {
        unsigned int toie4 : 1;	/* Timer/Counter4 Overflow Interrupt Enable */
        unsigned int ocie4a : 1;	/* Timer/Counter4 Output Compare A Match Interrupt Enable */
        unsigned int ocie4b : 1;	/* Timer/Counter4 Output Compare B Match Interrupt Enable */
        unsigned int ocie4c : 1;	/* Timer/Counter4 Output Compare C Match Interrupt Enable */
        unsigned int : 1;
        unsigned int icie4 : 1;	/* Timer/Counter4 Input Capture Interrupt Enable */
        unsigned int : 2;
};

#define TIMSK4_struct _SFR_MEM8_STRUCT(0x72, struct __reg_TIMSK4)

#endif /* __ASSEMBLER__ */

  /* TIMSK4 */

#define TOIE4                           0
#define OCIE4A                          1
#define OCIE4B                          2
#define OCIE4C                          3
#define ICIE4                           5

/* Timer/Counter5 Interrupt Mask Register */
#define TIMSK5                          _SFR_MEM8(0x73)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TIMSK5 {
        unsigned int toie5 : 1;	/* Timer/Counter5 Overflow Interrupt Enable */
        unsigned int ocie5a : 1;	/* Timer/Counter5 Output Compare A Match Interrupt Enable */
        unsigned int ocie5b : 1;	/* Timer/Counter5 Output Compare B Match Interrupt Enable */
        unsigned int ocie5c : 1;	/* Timer/Counter5 Output Compare C Match Interrupt Enable */
        unsigned int : 1;
        unsigned int icie5 : 1;	/* Timer/Counter5 Input Capture Interrupt Enable */
        unsigned int : 2;
};

#define TIMSK5_struct _SFR_MEM8_STRUCT(0x73, struct __reg_TIMSK5)

#endif /* __ASSEMBLER__ */

  /* TIMSK5 */

#define TOIE5                           0
#define OCIE5A                          1
#define OCIE5B                          2
#define OCIE5C                          3
#define ICIE5                           5

/* Flash Extended-Mode Control-Register */
#define NEMCR                           _SFR_MEM8(0x75)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_NEMCR {
        unsigned int : 4;
        unsigned int aeam : 2;	/* Address for Extended Address Mode of Extra Rows */
        unsigned int eneam : 1;	/* Enable Extended Address Mode for Extra Rows */
        unsigned int : 1;
};

#define NEMCR_struct _SFR_MEM8_STRUCT(0x75, struct __reg_NEMCR)

#endif /* __ASSEMBLER__ */

  /* NEMCR */

#define AEAM0                           4
#define AEAM1                           5
#define ENEAM                           6

/* The ADC Control and Status Register C */
#define ADCSRC                          _SFR_MEM8(0x77)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ADCSRC {
        unsigned int adsut : 5;	/* ADC Start-up Time */
        unsigned int res0 : 1;	/* Reserved */
        unsigned int adtht : 2;	/* ADC Track-and-Hold Time */
};

#define ADCSRC_struct _SFR_MEM8_STRUCT(0x77, struct __reg_ADCSRC)

#endif /* __ASSEMBLER__ */

  /* ADCSRC */

#define ADSUT0                          0
#define ADSUT1                          1
#define ADSUT2                          2
#define ADSUT3                          3
#define ADSUT4                          4
#define ADTHT0                          6
#define ADTHT1                          7

/* ADC Data Register  Bytes */
#ifndef __ASSEMBLER__
#define ADC                             _SFR_MEM16(0x78)
#define ADCL                            _SFR_MEM8(0x78)
#define ADCH                            _SFR_MEM8(0x79)
#endif /* __ASSEMBLER__ */
#define ADCW                            _SFR_MEM16(0x78)
#define ADCWL                           _SFR_MEM8(0x78)
#define ADCWH                           _SFR_MEM8(0x79)

/* The ADC Control and Status Register A */
#define ADCSRA                          _SFR_MEM8(0x7A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ADCSRA {
        unsigned int adps : 3;	/* ADC  Prescaler Select Bits */
        unsigned int adie : 1;	/* ADC Interrupt Enable */
        unsigned int adif : 1;	/* ADC Interrupt Flag */
        unsigned int adate : 1;	/* ADC Auto Trigger Enable */
        unsigned int adsc : 1;	/* ADC Start Conversion */
        unsigned int aden : 1;	/* ADC Enable */
};

#define ADCSRA_struct _SFR_MEM8_STRUCT(0x7a, struct __reg_ADCSRA)

#endif /* __ASSEMBLER__ */

  /* ADCSRA */

#define ADPS0                           0
#define ADPS1                           1
#define ADPS2                           2
#define ADIE                            3
#define ADIF                            4
#define ADATE                           5
#define ADSC                            6
#define ADEN                            7

/* ADC Control and Status Register B */
#define ADCSRB                          _SFR_MEM8(0x7B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ADCSRB {
        unsigned int adts : 3;	/* ADC Auto Trigger Source */
        unsigned int mux5 : 1;	/* Analog Channel and Gain Selection Bits */
        unsigned int acch : 1;	/* Analog Channel Change */
        unsigned int refok : 1;	/* Reference Voltage OK */
        unsigned int acme : 1;	/* Analog Comparator Multiplexer Enable */
        unsigned int avddok : 1;	/* AVDD Supply Voltage OK */
};

#define ADCSRB_struct _SFR_MEM8_STRUCT(0x7b, struct __reg_ADCSRB)

