arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* ADCSRB */

#define ADTS0                           0
#define ADTS1                           1
#define ADTS2                           2
#define MUX5                            3
#define ACCH                            4
#define REFOK                           5
#define ACME                            6
#define AVDDOK                          7

/* The ADC Multiplexer Selection Register */
#define ADMUX                           _SFR_MEM8(0x7C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ADMUX {
        unsigned int mux : 5;	/* Analog Channel and Gain Selection Bits */
        unsigned int adlar : 1;	/* ADC Left Adjust Result */
        unsigned int refs : 2;	/* Reference Selection Bits */
};

#define ADMUX_struct _SFR_MEM8_STRUCT(0x7c, struct __reg_ADMUX)

#endif /* __ASSEMBLER__ */

  /* ADMUX */

#define MUX0                            0
#define MUX1                            1
#define MUX2                            2
#define MUX3                            3
#define MUX4                            4
#define ADLAR                           5
#define REFS0                           6
#define REFS1                           7

/* Digital Input Disable Register 2 */
#define DIDR2                           _SFR_MEM8(0x7D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DIDR2 {
        unsigned int adc8d : 1;	/* Reserved Bits */
        unsigned int adc9d : 1;	/* Reserved Bits */
        unsigned int adc10d : 1;	/* Reserved Bits */
        unsigned int adc11d : 1;	/* Reserved Bits */
        unsigned int adc12d : 1;	/* Reserved Bits */
        unsigned int adc13d : 1;	/* Reserved Bits */
        unsigned int adc14d : 1;	/* Reserved Bits */
        unsigned int adc15d : 1;	/* Reserved Bits */
};

#define DIDR2_struct _SFR_MEM8_STRUCT(0x7d, struct __reg_DIDR2)

#endif /* __ASSEMBLER__ */

  /* DIDR2 */

#define ADC8D                           0
#define ADC9D                           1
#define ADC10D                          2
#define ADC11D                          3
#define ADC12D                          4
#define ADC13D                          5
#define ADC14D                          6
#define ADC15D                          7

/* Digital Input Disable Register 0 */
#define DIDR0                           _SFR_MEM8(0x7E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DIDR0 {
        unsigned int adc0d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc1d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc2d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc3d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc4d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc5d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc6d : 1;	/* Disable ADC7:0 Digital Input */
        unsigned int adc7d : 1;	/* Disable ADC7:0 Digital Input */
};

#define DIDR0_struct _SFR_MEM8_STRUCT(0x7e, struct __reg_DIDR0)

#endif /* __ASSEMBLER__ */

  /* DIDR0 */

#define ADC0D                           0
#define ADC1D                           1
#define ADC2D                           2
#define ADC3D                           3
#define ADC4D                           4
#define ADC5D                           5
#define ADC6D                           6
#define ADC7D                           7

/* Digital Input Disable Register 1 */
#define DIDR1                           _SFR_MEM8(0x7F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DIDR1 {
        unsigned int ain0d : 1;	/* AIN0 Digital Input Disable */
        unsigned int ain1d : 1;	/* AIN1 Digital Input Disable */
        unsigned int : 6;
};

#define DIDR1_struct _SFR_MEM8_STRUCT(0x7f, struct __reg_DIDR1)

#endif /* __ASSEMBLER__ */

  /* DIDR1 */

#define AIN0D                           0
#define AIN1D                           1

/* Timer/Counter1 Control Register A */
#define TCCR1A                          _SFR_MEM8(0x80)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR1A {
        unsigned int wgm1 : 2;	/* Waveform Generation Mode */
        unsigned int com1c : 2;	/* Compare Output Mode for Channel C */
        unsigned int com1b : 2;	/* Compare Output Mode for Channel B */
        unsigned int com1a : 2;	/* Compare Output Mode for Channel A */
};

#define TCCR1A_struct _SFR_MEM8_STRUCT(0x80, struct __reg_TCCR1A)

#endif /* __ASSEMBLER__ */

  /* TCCR1A */

#define WGM10                           0
#define WGM11                           1
#define COM1C0                          2
#define COM1C1                          3
#define COM1B0                          4
#define COM1B1                          5
#define COM1A0                          6
#define COM1A1                          7

/* Timer/Counter1 Control Register B */
#define TCCR1B                          _SFR_MEM8(0x81)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR1B {
        unsigned int cs1 : 3;	/* Clock Select */
        unsigned int wgm1 : 2;	/* Waveform Generation Mode */
        unsigned int : 1;
        unsigned int ices1 : 1;	/* Input Capture 1 Edge Select */
        unsigned int icnc1 : 1;	/* Input Capture 1 Noise Canceller */
};

#define TCCR1B_struct _SFR_MEM8_STRUCT(0x81, struct __reg_TCCR1B)

#endif /* __ASSEMBLER__ */

  /* TCCR1B */

#define CS10                            0
#define CS11                            1
#define CS12                            2
#define WGM12                           3
#define WGM13                           4
#define ICES1                           6
#define ICNC1                           7

/* Timer/Counter1 Control Register C */
#define TCCR1C                          _SFR_MEM8(0x82)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

