arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
struct __reg_TCCR1C {
        unsigned int : 5;
        unsigned int foc1c : 1;	/* Force Output Compare for Channel C */
        unsigned int foc1b : 1;	/* Force Output Compare for Channel B */
        unsigned int foc1a : 1;	/* Force Output Compare for Channel A */
};

#define TCCR1C_struct _SFR_MEM8_STRUCT(0x82, struct __reg_TCCR1C)

#endif /* __ASSEMBLER__ */

  /* TCCR1C */

#define FOC1C                           5
#define FOC1B                           6
#define FOC1A                           7

/* Timer/Counter1  Bytes */
#define TCNT1                           _SFR_MEM16(0x84)
#define TCNT1L                          _SFR_MEM8(0x84)
#define TCNT1H                          _SFR_MEM8(0x85)

/* Timer/Counter1 Input Capture Register  Bytes */
#define ICR1                            _SFR_MEM16(0x86)
#define ICR1L                           _SFR_MEM8(0x86)
#define ICR1H                           _SFR_MEM8(0x87)

/* Timer/Counter1 Output Compare Register A  Bytes */
#define OCR1A                           _SFR_MEM16(0x88)
#define OCR1AL                          _SFR_MEM8(0x88)
#define OCR1AH                          _SFR_MEM8(0x89)

/* Timer/Counter1 Output Compare Register B  Bytes */
#define OCR1B                           _SFR_MEM16(0x8A)
#define OCR1BL                          _SFR_MEM8(0x8A)
#define OCR1BH                          _SFR_MEM8(0x8B)

/* Timer/Counter1 Output Compare Register C  Bytes */
#define OCR1C                           _SFR_MEM16(0x8C)
#define OCR1CL                          _SFR_MEM8(0x8C)
#define OCR1CH                          _SFR_MEM8(0x8D)

/* Timer/Counter3 Control Register A */
#define TCCR3A                          _SFR_MEM8(0x90)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR3A {
        unsigned int wgm3 : 2;	/* Waveform Generation Mode */
        unsigned int com3c : 2;	/* Compare Output Mode for Channel C */
        unsigned int com3b : 2;	/* Compare Output Mode for Channel B */
        unsigned int com3a : 2;	/* Compare Output Mode for Channel A */
};

#define TCCR3A_struct _SFR_MEM8_STRUCT(0x90, struct __reg_TCCR3A)

#endif /* __ASSEMBLER__ */

  /* TCCR3A */

#define WGM30                           0
#define WGM31                           1
#define COM3C0                          2
#define COM3C1                          3
#define COM3B0                          4
#define COM3B1                          5
#define COM3A0                          6
#define COM3A1                          7

/* Timer/Counter3 Control Register B */
#define TCCR3B                          _SFR_MEM8(0x91)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR3B {
        unsigned int cs3 : 3;	/* Clock Select */
        unsigned int wgm3 : 2;	/* Waveform Generation Mode */
        unsigned int : 1;
        unsigned int ices3 : 1;	/* Input Capture 3 Edge Select */
        unsigned int icnc3 : 1;	/* Input Capture 3 Noise Canceller */
};

#define TCCR3B_struct _SFR_MEM8_STRUCT(0x91, struct __reg_TCCR3B)

#endif /* __ASSEMBLER__ */

  /* TCCR3B */

#define CS30                            0
#define CS31                            1
#define CS32                            2
#define WGM32                           3
#define WGM33                           4
#define ICES3                           6
#define ICNC3                           7

/* Timer/Counter3 Control Register C */
#define TCCR3C                          _SFR_MEM8(0x92)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR3C {
        unsigned int : 5;
        unsigned int foc3c : 1;	/* Force Output Compare for Channel C */
        unsigned int foc3b : 1;	/* Force Output Compare for Channel B */
        unsigned int foc3a : 1;	/* Force Output Compare for Channel A */
};

#define TCCR3C_struct _SFR_MEM8_STRUCT(0x92, struct __reg_TCCR3C)

#endif /* __ASSEMBLER__ */

  /* TCCR3C */

#define FOC3C                           5
#define FOC3B                           6
#define FOC3A                           7

/* Timer/Counter3  Bytes */
#define TCNT3                           _SFR_MEM16(0x94)
#define TCNT3L                          _SFR_MEM8(0x94)
#define TCNT3H                          _SFR_MEM8(0x95)

/* Timer/Counter3 Input Capture Register  Bytes */
#define ICR3                            _SFR_MEM16(0x96)
#define ICR3L                           _SFR_MEM8(0x96)
#define ICR3H                           _SFR_MEM8(0x97)

/* Timer/Counter3 Output Compare Register A  Bytes */
#define OCR3A                           _SFR_MEM16(0x98)
#define OCR3AL                          _SFR_MEM8(0x98)
#define OCR3AH                          _SFR_MEM8(0x99)

/* Timer/Counter3 Output Compare Register B  Bytes */
#define OCR3B                           _SFR_MEM16(0x9A)
#define OCR3BL                          _SFR_MEM8(0x9A)
#define OCR3BH                          _SFR_MEM8(0x9B)

/* Timer/Counter3 Output Compare Register C  Bytes */
#define OCR3C                           _SFR_MEM16(0x9C)
#define OCR3CL                          _SFR_MEM8(0x9C)
#define OCR3CH                          _SFR_MEM8(0x9D)

/* Timer/Counter4 Control Register A */
#define TCCR4A                          _SFR_MEM8(0xA0)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR4A {
        unsigned int wgm4 : 2;	/* Waveform Generation Mode */
        unsigned int com4c : 2;	/* Compare Output Mode for Channel C */
        unsigned int com4b : 2;	/* Compare Output Mode for Channel B */
        unsigned int com4a : 2;	/* Compare Output Mode for Channel A */
};

#define TCCR4A_struct _SFR_MEM8_STRUCT(0xa0, struct __reg_TCCR4A)

#endif /* __ASSEMBLER__ */

  /* TCCR4A */

#define WGM40                           0
#define WGM41                           1
#define COM4C0                          2
#define COM4C1                          3
#define COM4B0                          4
#define COM4B1                          5
#define COM4A0                          6
#define COM4A1                          7

/* Timer/Counter4 Control Register B */
#define TCCR4B                          _SFR_MEM8(0xA1)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR4B {
        unsigned int cs4 : 3;	/* Clock Select */
        unsigned int wgm4 : 2;	/* Waveform Generation Mode */
        unsigned int : 1;
        unsigned int ices4 : 1;	/* Input Capture 4 Edge Select */
        unsigned int icnc4 : 1;	/* Input Capture 4 Noise Canceller */
};

#define TCCR4B_struct _SFR_MEM8_STRUCT(0xa1, struct __reg_TCCR4B)

