arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* TCCR4B */

#define CS40                            0
#define CS41                            1
#define CS42                            2
#define WGM42                           3
#define WGM43                           4
#define ICES4                           6
#define ICNC4                           7

/* Timer/Counter4 Control Register C */
#define TCCR4C                          _SFR_MEM8(0xA2)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR4C {
        unsigned int : 5;
        unsigned int foc4c : 1;	/* Force Output Compare for Channel C */
        unsigned int foc4b : 1;	/* Force Output Compare for Channel B */
        unsigned int foc4a : 1;	/* Force Output Compare for Channel A */
};

#define TCCR4C_struct _SFR_MEM8_STRUCT(0xa2, struct __reg_TCCR4C)

#endif /* __ASSEMBLER__ */

  /* TCCR4C */

#define FOC4C                           5
#define FOC4B                           6
#define FOC4A                           7

/* Timer/Counter4  Bytes */
#define TCNT4                           _SFR_MEM16(0xA4)
#define TCNT4L                          _SFR_MEM8(0xA4)
#define TCNT4H                          _SFR_MEM8(0xA5)

/* Timer/Counter4 Input Capture Register  Bytes */
#define ICR4                            _SFR_MEM16(0xA6)
#define ICR4L                           _SFR_MEM8(0xA6)
#define ICR4H                           _SFR_MEM8(0xA7)

/* Timer/Counter4 Output Compare Register A  Bytes */
#define OCR4A                           _SFR_MEM16(0xA8)
#define OCR4AL                          _SFR_MEM8(0xA8)
#define OCR4AH                          _SFR_MEM8(0xA9)

/* Timer/Counter4 Output Compare Register B  Bytes */
#define OCR4B                           _SFR_MEM16(0xAA)
#define OCR4BL                          _SFR_MEM8(0xAA)
#define OCR4BH                          _SFR_MEM8(0xAB)

/* Timer/Counter4 Output Compare Register C  Bytes */
#define OCR4C                           _SFR_MEM16(0xAC)
#define OCR4CL                          _SFR_MEM8(0xAC)
#define OCR4CH                          _SFR_MEM8(0xAD)

/* Timer/Counter2 Control Register A */
#define TCCR2A                          _SFR_MEM8(0xB0)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR2A {
        unsigned int wgm2 : 2;	/* Waveform Generation Mode */
        unsigned int : 2;
        unsigned int com2b : 2;	/* Compare Match Output B Mode */
        unsigned int com2a : 2;	/* Compare Match Output A Mode */
};

#define TCCR2A_struct _SFR_MEM8_STRUCT(0xb0, struct __reg_TCCR2A)

#endif /* __ASSEMBLER__ */

  /* TCCR2A */

#define WGM20                           0
#define WGM21                           1
#define COM2B0                          4
#define COM2B1                          5
#define COM2A0                          6
#define COM2A1                          7

/* Timer/Counter2 Control Register B */
#define TCCR2B                          _SFR_MEM8(0xB1)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR2B {
        unsigned int cs2 : 3;	/* Clock Select */
        unsigned int wgm22 : 1;	/* Waveform Generation Mode */
        unsigned int : 2;
        unsigned int foc2b : 1;	/* Force Output Compare B */
        unsigned int foc2a : 1;	/* Force Output Compare A */
};

#define TCCR2B_struct _SFR_MEM8_STRUCT(0xb1, struct __reg_TCCR2B)

#endif /* __ASSEMBLER__ */

  /* TCCR2B */

#define CS20                            0
#define CS21                            1
#define CS22                            2
#define WGM22                           3
#define FOC2B                           6
#define FOC2A                           7

/* Timer/Counter2 */
#define TCNT2                           _SFR_MEM8(0xB2)

  /* TCNT2 */

#define TCNT20                          0
#define TCNT21                          1
#define TCNT22                          2
#define TCNT23                          3
#define TCNT24                          4
#define TCNT25                          5
#define TCNT26                          6
#define TCNT27                          7

/* Timer/Counter2 Output Compare Register A */
#define OCR2A                           _SFR_MEM8(0xB3)

  /* OCR2A */

#define OCR2A0                          0
#define OCR2A1                          1
#define OCR2A2                          2
#define OCR2A3                          3
#define OCR2A4                          4
#define OCR2A5                          5
#define OCR2A6                          6
#define OCR2A7                          7

/* Timer/Counter2 Output Compare Register B */
#define OCR2B                           _SFR_MEM8(0xB4)

  /* OCR2B */

#define OCR2B0                          0
#define OCR2B1                          1
#define OCR2B2                          2
#define OCR2B3                          3
#define OCR2B4                          4
#define OCR2B5                          5
#define OCR2B6                          6
#define OCR2B7                          7

/* Asynchronous Status Register */
#define ASSR                            _SFR_MEM8(0xB6)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ASSR {
        unsigned int tcr2bub : 1;	/* Timer/Counter2 Control Register B Update Busy */
        unsigned int tcr2aub : 1;	/* Timer/Counter2 Control Register A Update Busy */
        unsigned int ocr2bub : 1;	/* Timer/Counter2 Output Compare Register B Update Busy */
        unsigned int ocr2aub : 1;	/* Timer/Counter2 Output Compare Register A Update Busy */
        unsigned int tcn2ub : 1;	/* Timer/Counter2 Update Busy */
        unsigned int as2 : 1;	/* Timer/Counter2 Asynchronous Mode */
        unsigned int exclk : 1;	/* Enable External Clock Input */
        unsigned int exclkamr : 1;	/* Enable External Clock Input for AMR */
};

#define ASSR_struct _SFR_MEM8_STRUCT(0xb6, struct __reg_ASSR)

