arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* ASSR */

#define TCR2BUB                         0
#define TCR2AUB                         1
#define OCR2BUB                         2
#define OCR2AUB                         3
#define TCN2UB                          4
#define AS2                             5
#define EXCLK                           6
#define EXCLKAMR                        7

/* TWI Bit Rate Register */
#define TWBR                            _SFR_MEM8(0xB8)

  /* TWBR */

#define TWBR0                           0
#define TWBR1                           1
#define TWBR2                           2
#define TWBR3                           3
#define TWBR4                           4
#define TWBR5                           5
#define TWBR6                           6
#define TWBR7                           7

/* TWI Status Register */
#define TWSR                            _SFR_MEM8(0xB9)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TWSR {
        unsigned int twps : 2;	/* TWI Prescaler Bits */
        unsigned int : 1;
        unsigned int tws : 5;	/* TWI Status */
};

#define TWSR_struct _SFR_MEM8_STRUCT(0xb9, struct __reg_TWSR)

#endif /* __ASSEMBLER__ */

  /* TWSR */

#define TWPS0                           0
#define TWPS1                           1
#define TWS3                            3
#define TWS4                            4
#define TWS5                            5
#define TWS6                            6
#define TWS7                            7

/* TWI (Slave) Address Register */
#define TWAR                            _SFR_MEM8(0xBA)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TWAR {
        unsigned int twgce : 1;	/* TWI General Call Recognition Enable Bit */
        unsigned int twa : 7;	/* TWI (Slave) Address */
};

#define TWAR_struct _SFR_MEM8_STRUCT(0xba, struct __reg_TWAR)

#endif /* __ASSEMBLER__ */

  /* TWAR */

#define TWGCE                           0
#define TWA0                            1
#define TWA1                            2
#define TWA2                            3
#define TWA3                            4
#define TWA4                            5
#define TWA5                            6
#define TWA6                            7

/* TWI Data Register */
#define TWDR                            _SFR_MEM8(0xBB)

  /* TWDR */

#define TWD0                            0
#define TWD1                            1
#define TWD2                            2
#define TWD3                            3
#define TWD4                            4
#define TWD5                            5
#define TWD6                            6
#define TWD7                            7

/* TWI Control Register */
#define TWCR                            _SFR_MEM8(0xBC)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TWCR {
        unsigned int twie : 1;	/* TWI Interrupt Enable */
        unsigned int : 1;
        unsigned int twen : 1;	/* TWI Enable Bit */
        unsigned int twwc : 1;	/* TWI Write Collision Flag */
        unsigned int twsto : 1;	/* TWI STOP Condition Bit */
        unsigned int twsta : 1;	/* TWI START Condition Bit */
        unsigned int twea : 1;	/* TWI Enable Acknowledge Bit */
        unsigned int twint : 1;	/* TWI Interrupt Flag */
};

#define TWCR_struct _SFR_MEM8_STRUCT(0xbc, struct __reg_TWCR)

#endif /* __ASSEMBLER__ */

  /* TWCR */

#define TWIE                            0
#define TWEN                            2
#define TWWC                            3
#define TWSTO                           4
#define TWSTA                           5
#define TWEA                            6
#define TWINT                           7

/* TWI (Slave) Address Mask Register */
#define TWAMR                           _SFR_MEM8(0xBD)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TWAMR {
        unsigned int : 1;
        unsigned int twam : 7;	/* TWI Address Mask */
};

#define TWAMR_struct _SFR_MEM8_STRUCT(0xbd, struct __reg_TWAMR)

#endif /* __ASSEMBLER__ */

  /* TWAMR */

#define TWAM0                           1
#define TWAMR0                          1
#define TWAM1                           2
#define TWAMR1                          2
#define TWAM2                           3
#define TWAMR2                          3
#define TWAM3                           4
#define TWAMR3                          4
#define TWAM4                           5
#define TWAMR4                          5
#define TWAM5                           6
#define TWAMR5                          6
#define TWAM6                           7
#define TWAMR6                          7

/* USART0 Control and Status Register A */
#define UCSR0A                          _SFR_MEM8(0xC0)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_UCSR0A {
        unsigned int mpcm0 : 1;	/* Multi-processor Communication Mode */
        unsigned int u2x0 : 1;	/* Double the USART Transmission Speed */
        unsigned int upe0 : 1;	/* USART Parity Error */
        unsigned int dor0 : 1;	/* Data OverRun */
        unsigned int fe0 : 1;	/* Frame Error */
        unsigned int udre0 : 1;	/* USART Data Register Empty */
        unsigned int txc0 : 1;	/* USART Transmit Complete */
        unsigned int rxc0 : 1;	/* USART Receive Complete */
};

#define UCSR0A_struct _SFR_MEM8_STRUCT(0xc0, struct __reg_UCSR0A)

#endif /* __ASSEMBLER__ */

  /* UCSR0A */

#define MPCM0                           0
#define U2X0                            1
#define UPE0                            2
#define DOR0                            3
#define FE0                             4
#define UDRE0                           5
#define TXC0                            6
#define RXC0                            7

/* USART0 Control and Status Register B */
#define UCSR0B                          _SFR_MEM8(0xC1)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_UCSR0B {
        unsigned int txb80 : 1;	/* Transmit Data Bit 8 */
        unsigned int rxb80 : 1;	/* Receive Data Bit 8 */
        unsigned int ucsz02 : 1;	/* Character Size */
        unsigned int txen0 : 1;	/* Transmitter Enable */
        unsigned int rxen0 : 1;	/* Receiver Enable */
        unsigned int udrie0 : 1;	/* USART Data Register Empty Interrupt Enable */
        unsigned int txcie0 : 1;	/* TX Complete Interrupt Enable */
        unsigned int rxcie0 : 1;	/* RX Complete Interrupt Enable */
};

#define UCSR0B_struct _SFR_MEM8_STRUCT(0xc1, struct __reg_UCSR0B)

