arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* UCSR0B */

#define TXB80                           0
#define RXB80                           1
#define UCSZ02                          2
#define TXEN0                           3
#define RXEN0                           4
#define UDRIE0                          5
#define TXCIE0                          6
#define RXCIE0                          7

/* USART0 Control and Status Register C */
#define UCSR0C                          _SFR_MEM8(0xC2)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_UCSR0C {
        unsigned int ucpol0 : 1;	/* Clock Polarity */
        unsigned int ucsz0 : 2;	/* Character Size */
        unsigned int usbs0 : 1;	/* Stop Bit Select */
        unsigned int upm0 : 2;	/* Parity Mode */
        unsigned int umsel0 : 2;	/* USART Mode Select */
};
/* NOTE: UCSR0C in SPI mode have only lower three bits.
  UCORD1 Data Order
  UCPHA1 Clock Phase
  UCPOL1 Clock Polarity
*/

#define UCSR0C_struct _SFR_MEM8_STRUCT(0xc2, struct __reg_UCSR0C)

#endif /* __ASSEMBLER__ */

  /* UCSR0C */

#define UCPOL0                          0
#define UCPHA0                          1
#define UCSZ00                          1
#define UDORD0                          2
#define UCSZ01                          2
#define USBS0                           3
#define UPM00                           4
#define UPM01                           5
#define UMSEL00                         6
#define UMSEL0                          6
#define UMSEL01                         7
#define UMSEL1                          7

/* USART0 Baud Rate Register  Bytes */
#define UBRR0                           _SFR_MEM16(0xC4)
#define UBRR0L                          _SFR_MEM8(0xC4)
#define UBRR0H                          _SFR_MEM8(0xC5)

/* USART0 I/O Data Register */
#define UDR0                            _SFR_MEM8(0xC6)

  /* UDR0 */

#define UDR00                           0
#define UDR01                           1
#define UDR02                           2
#define UDR03                           3
#define UDR04                           4
#define UDR05                           5
#define UDR06                           6
#define UDR07                           7

/* USART1 Control and Status Register A */
#define UCSR1A                          _SFR_MEM8(0xC8)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_UCSR1A {
        unsigned int mpcm1 : 1;	/* Multi-processor Communication Mode */
        unsigned int u2x1 : 1;	/* Double the USART Transmission Speed */
        unsigned int upe1 : 1;	/* USART Parity Error */
        unsigned int dor1 : 1;	/* Data OverRun */
        unsigned int fe1 : 1;	/* Frame Error */
        unsigned int udre1 : 1;	/* USART Data Register Empty */
        unsigned int txc1 : 1;	/* USART Transmit Complete */
        unsigned int rxc1 : 1;	/* USART Receive Complete */
};

#define UCSR1A_struct _SFR_MEM8_STRUCT(0xc8, struct __reg_UCSR1A)

#endif /* __ASSEMBLER__ */

  /* UCSR1A */

#define MPCM1                           0
#define U2X1                            1
#define UPE1                            2
#define DOR1                            3
#define FE1                             4
#define UDRE1                           5
#define TXC1                            6
#define RXC1                            7

/* USART1 Control and Status Register B */
#define UCSR1B                          _SFR_MEM8(0xC9)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_UCSR1B {
        unsigned int txb81 : 1;	/* Transmit Data Bit 8 */
        unsigned int rxb81 : 1;	/* Receive Data Bit 8 */
        unsigned int ucsz12 : 1;	/* Character Size */
        unsigned int txen1 : 1;	/* Transmitter Enable */
        unsigned int rxen1 : 1;	/* Receiver Enable */
        unsigned int udrie1 : 1;	/* USART Data Register Empty Interrupt Enable */
        unsigned int txcie1 : 1;	/* TX Complete Interrupt Enable */
        unsigned int rxcie1 : 1;	/* RX Complete Interrupt Enable */
};

#define UCSR1B_struct _SFR_MEM8_STRUCT(0xc9, struct __reg_UCSR1B)

#endif /* __ASSEMBLER__ */

  /* UCSR1B */

#define TXB81                           0
#define RXB81                           1
#define UCSZ12                          2
#define TXEN1                           3
#define RXEN1                           4
#define UDRIE1                          5
#define TXCIE1                          6
#define RXCIE1                          7

/* USART1 Control and Status Register C */
#define UCSR1C                          _SFR_MEM8(0xCA)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_UCSR1C {
        unsigned int ucpol1 : 1;	/* Clock Polarity */
        unsigned int ucsz1 : 2;	/* Character Size */
        unsigned int usbs1 : 1;	/* Stop Bit Select */
        unsigned int upm1 : 2;	/* Parity Mode */
        unsigned int umsel1 : 2;	/* USART Mode Select */
};
/* NOTE: UCSR1C in SPI mode have only lower three bits.
  UCORD1 Data Order
  UCPHA1 Clock Phase
  UCPOL1 Clock Polarity
*/
#define UCSR1C_struct _SFR_MEM8_STRUCT(0xca, struct __reg_UCSR1C)

#endif /* __ASSEMBLER__ */

  /* UCSR1C */

#define UCPOL1                          0
#define UCPHA1                          1
#define UCSZ10                          1
#define UDORD1                          2
#define UCSZ11                          2
#define USBS1                           3
#define UPM10                           4
#define UPM11                           5
#define UMSEL10                         6
#define UMSEL11                         7

/* USART1 Baud Rate Register  Bytes */
#define UBRR1                           _SFR_MEM16(0xCC)
#define UBRR1L                          _SFR_MEM8(0xCC)
#define UBRR1H                          _SFR_MEM8(0xCD)

/* USART1 I/O Data Register */
#define UDR1                            _SFR_MEM8(0xCE)

