arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
  /* UDR1 */

#define UDR10                           0
#define UDR11                           1
#define UDR12                           2
#define UDR13                           3
#define UDR14                           4
#define UDR15                           5
#define UDR16                           6
#define UDR17                           7

/* Symbol Counter Control Register 0 */
#define SCCR0                           _SFR_MEM8(0xDC)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCCR0 {
        unsigned int sccmp : 3;	/* Symbol Counter Compare Unit 3 Mode select */
        unsigned int sctse : 1;	/* Symbol Counter Automatic Timestamping enable */
        unsigned int sccksel : 1;	/* Symbol Counter Clock Source select */
        unsigned int scen : 1;	/* Symbol Counter enable */
        unsigned int scmbts : 1;	/* Manual Beacon Timestamp */
        unsigned int scres : 1;	/* Symbol Counter Synchronization */
};

#define SCCR0_struct _SFR_MEM8_STRUCT(0xdc, struct __reg_SCCR0)

#endif /* __ASSEMBLER__ */

  /* SCCR0 */

#define SCCMP1                          0
#define SCCMP2                          1
#define SCCMP3                          2
#define SCTSE                           3
#define SCCKSEL                         4
#define SCEN                            5
#define SCMBTS                          6
#define SCRES                           7

/* Symbol Counter Control Register 1 */
#define SCCR1                           _SFR_MEM8(0xDD)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCCR1 {
        unsigned int scenbo : 1;	/* Backoff Slot Counter enable */
        unsigned int : 7;
};

#define SCCR1_struct _SFR_MEM8_STRUCT(0xdd, struct __reg_SCCR1)

#endif /* __ASSEMBLER__ */

  /* SCCR1 */

#define SCENBO                          0

/* Symbol Counter Status Register */
#define SCSR                            _SFR_MEM8(0xDE)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCSR {
        unsigned int scbsy : 1;	/* Symbol Counter busy */
        unsigned int : 7;
};

#define SCSR_struct _SFR_MEM8_STRUCT(0xde, struct __reg_SCSR)

#endif /* __ASSEMBLER__ */

  /* SCSR */

#define SCBSY                           0

/* Symbol Counter Interrupt Mask Register */
#define SCIRQM                          _SFR_MEM8(0xDF)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCIRQM {
        unsigned int irqmcp : 3;	/* Symbol Counter Compare Match 3 IRQ enable */
        unsigned int irqmof : 1;	/* Symbol Counter Overflow IRQ enable */
        unsigned int irqmbo : 1;	/* Backoff Slot Counter IRQ enable */
        unsigned int : 3;
};

#define SCIRQM_struct _SFR_MEM8_STRUCT(0xdf, struct __reg_SCIRQM)

#endif /* __ASSEMBLER__ */

  /* SCIRQM */

#define IRQMCP1                         0
#define IRQMCP2                         1
#define IRQMCP3                         2
#define IRQMOF                          3
#define IRQMBO                          4

/* Symbol Counter Interrupt Status Register */
#define SCIRQS                          _SFR_MEM8(0xE0)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCIRQS {
        unsigned int irqscp : 3;	/* Compare Unit 3 Compare Match IRQ */
        unsigned int irqsof : 1;	/* Symbol Counter Overflow IRQ */
        unsigned int irqsbo : 1;	/* Backoff Slot Counter IRQ */
        unsigned int : 3;
};

#define SCIRQS_struct _SFR_MEM8_STRUCT(0xe0, struct __reg_SCIRQS)

#endif /* __ASSEMBLER__ */

  /* SCIRQS */

#define IRQSCP1                         0
#define IRQSCP2                         1
#define IRQSCP3                         2
#define IRQSOF                          3
#define IRQSBO                          4

/* Symbol Counter Register LL-Byte */
#define SCCNTLL                         _SFR_MEM8(0xE1)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCCNTLL {
        unsigned int sccntll : 8;	/* Symbol Counter Register LL-Byte */
};

#define SCCNTLL_struct _SFR_MEM8_STRUCT(0xe1, struct __reg_SCCNTLL)

#endif /* __ASSEMBLER__ */

  /* SCCNTLL */

#define SCCNTLL0                        0
#define SCCNTLL1                        1
#define SCCNTLL2                        2
#define SCCNTLL3                        3
#define SCCNTLL4                        4
#define SCCNTLL5                        5
#define SCCNTLL6                        6
#define SCCNTLL7                        7

/* Symbol Counter Register LH-Byte */
#define SCCNTLH                         _SFR_MEM8(0xE2)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCCNTLH {
        unsigned int sccntlh : 8;	/* Symbol Counter Register LH-Byte */
};

#define SCCNTLH_struct _SFR_MEM8_STRUCT(0xe2, struct __reg_SCCNTLH)

#endif /* __ASSEMBLER__ */

  /* SCCNTLH */

#define SCCNTLH0                        0
#define SCCNTLH1                        1
#define SCCNTLH2                        2
#define SCCNTLH3                        3
#define SCCNTLH4                        4
#define SCCNTLH5                        5
#define SCCNTLH6                        6
#define SCCNTLH7                        7

/* Symbol Counter Register HL-Byte */
#define SCCNTHL                         _SFR_MEM8(0xE3)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCCNTHL {
        unsigned int sccnthl : 8;	/* Symbol Counter Register HL-Byte */
};

#define SCCNTHL_struct _SFR_MEM8_STRUCT(0xe3, struct __reg_SCCNTHL)

#endif /* __ASSEMBLER__ */

  /* SCCNTHL */

#define SCCNTHL0                        0
#define SCCNTHL1                        1
#define SCCNTHL2                        2
#define SCCNTHL3                        3
#define SCCNTHL4                        4
#define SCCNTHL5                        5
#define SCCNTHL6                        6
#define SCCNTHL7                        7

/* Symbol Counter Register HH-Byte */
#define SCCNTHH                         _SFR_MEM8(0xE4)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCCNTHH {
        unsigned int sccnthh : 8;	/* Symbol Counter Register HH-Byte */
};

#define SCCNTHH_struct _SFR_MEM8_STRUCT(0xe4, struct __reg_SCCNTHH)

