arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* SCCNTHH */

#define SCCNTHH0                        0
#define SCCNTHH1                        1
#define SCCNTHH2                        2
#define SCCNTHH3                        3
#define SCCNTHH4                        4
#define SCCNTHH5                        5
#define SCCNTHH6                        6
#define SCCNTHH7                        7

/* Symbol Counter Beacon Timestamp Register LL-Byte */
#define SCBTSRLL                        _SFR_MEM8(0xE5)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCBTSRLL {
        unsigned int scbtsrll : 8;	/* Symbol Counter Beacon Timestamp Register LL-Byte */
};

#define SCBTSRLL_struct _SFR_MEM8_STRUCT(0xe5, struct __reg_SCBTSRLL)

#endif /* __ASSEMBLER__ */

  /* SCBTSRLL */

#define SCBTSRLL0                       0
#define SCBTSRLL1                       1
#define SCBTSRLL2                       2
#define SCBTSRLL3                       3
#define SCBTSRLL4                       4
#define SCBTSRLL5                       5
#define SCBTSRLL6                       6
#define SCBTSRLL7                       7

/* Symbol Counter Beacon Timestamp Register LH-Byte */
#define SCBTSRLH                        _SFR_MEM8(0xE6)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCBTSRLH {
        unsigned int scbtsrlh : 8;	/* Symbol Counter Beacon Timestamp Register LH-Byte */
};

#define SCBTSRLH_struct _SFR_MEM8_STRUCT(0xe6, struct __reg_SCBTSRLH)

#endif /* __ASSEMBLER__ */

  /* SCBTSRLH */

#define SCBTSRLH0                       0
#define SCBTSRLH1                       1
#define SCBTSRLH2                       2
#define SCBTSRLH3                       3
#define SCBTSRLH4                       4
#define SCBTSRLH5                       5
#define SCBTSRLH6                       6
#define SCBTSRLH7                       7

/* Symbol Counter Beacon Timestamp Register HL-Byte */
#define SCBTSRHL                        _SFR_MEM8(0xE7)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCBTSRHL {
        unsigned int scbtsrhl : 8;	/* Symbol Counter Beacon Timestamp Register HL-Byte */
};

#define SCBTSRHL_struct _SFR_MEM8_STRUCT(0xe7, struct __reg_SCBTSRHL)

#endif /* __ASSEMBLER__ */

  /* SCBTSRHL */

#define SCBTSRHL0                       0
#define SCBTSRHL1                       1
#define SCBTSRHL2                       2
#define SCBTSRHL3                       3
#define SCBTSRHL4                       4
#define SCBTSRHL5                       5
#define SCBTSRHL6                       6
#define SCBTSRHL7                       7

/* Symbol Counter Beacon Timestamp Register HH-Byte */
#define SCBTSRHH                        _SFR_MEM8(0xE8)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCBTSRHH {
        unsigned int scbtsrhh : 8;	/* Symbol Counter Beacon Timestamp Register HH-Byte */
};

#define SCBTSRHH_struct _SFR_MEM8_STRUCT(0xe8, struct __reg_SCBTSRHH)

#endif /* __ASSEMBLER__ */

  /* SCBTSRHH */

#define SCBTSRHH0                       0
#define SCBTSRHH1                       1
#define SCBTSRHH2                       2
#define SCBTSRHH3                       3
#define SCBTSRHH4                       4
#define SCBTSRHH5                       5
#define SCBTSRHH6                       6
#define SCBTSRHH7                       7

/* Symbol Counter Frame Timestamp Register LL-Byte */
#define SCTSRLL                         _SFR_MEM8(0xE9)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCTSRLL {
        unsigned int sctsrll : 8;	/* Symbol Counter Frame Timestamp Register LL-Byte */
};

#define SCTSRLL_struct _SFR_MEM8_STRUCT(0xe9, struct __reg_SCTSRLL)

#endif /* __ASSEMBLER__ */

  /* SCTSRLL */

#define SCTSRLL0                        0
#define SCTSRLL1                        1
#define SCTSRLL2                        2
#define SCTSRLL3                        3
#define SCTSRLL4                        4
#define SCTSRLL5                        5
#define SCTSRLL6                        6
#define SCTSRLL7                        7

/* Symbol Counter Frame Timestamp Register LH-Byte */
#define SCTSRLH                         _SFR_MEM8(0xEA)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCTSRLH {
        unsigned int sctsrlh : 8;	/* Symbol Counter Frame Timestamp Register LH-Byte */
};

#define SCTSRLH_struct _SFR_MEM8_STRUCT(0xea, struct __reg_SCTSRLH)

#endif /* __ASSEMBLER__ */

  /* SCTSRLH */

#define SCTSRLH0                        0
#define SCTSRLH1                        1
#define SCTSRLH2                        2
#define SCTSRLH3                        3
#define SCTSRLH4                        4
#define SCTSRLH5                        5
#define SCTSRLH6                        6
#define SCTSRLH7                        7

/* Symbol Counter Frame Timestamp Register HL-Byte */
#define SCTSRHL                         _SFR_MEM8(0xEB)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCTSRHL {
        unsigned int sctsrhl : 8;	/* Symbol Counter Frame Timestamp Register HL-Byte */
};

#define SCTSRHL_struct _SFR_MEM8_STRUCT(0xeb, struct __reg_SCTSRHL)

#endif /* __ASSEMBLER__ */

  /* SCTSRHL */

#define SCTSRHL0                        0
#define SCTSRHL1                        1
#define SCTSRHL2                        2
#define SCTSRHL3                        3
#define SCTSRHL4                        4
#define SCTSRHL5                        5
#define SCTSRHL6                        6
#define SCTSRHL7                        7

/* Symbol Counter Frame Timestamp Register HH-Byte */
#define SCTSRHH                         _SFR_MEM8(0xEC)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCTSRHH {
        unsigned int sctsrhh : 8;	/* Symbol Counter Frame Timestamp Register HH-Byte */
};

#define SCTSRHH_struct _SFR_MEM8_STRUCT(0xec, struct __reg_SCTSRHH)

