arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* SCTSRHH */

#define SCTSRHH0                        0
#define SCTSRHH1                        1
#define SCTSRHH2                        2
#define SCTSRHH3                        3
#define SCTSRHH4                        4
#define SCTSRHH5                        5
#define SCTSRHH6                        6
#define SCTSRHH7                        7

/* Symbol Counter Output Compare Register 3 LL-Byte */
#define SCOCR3LL                        _SFR_MEM8(0xED)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR3LL {
        unsigned int scocr3ll : 8;	/* Symbol Counter Output Compare Register 3 LL-Byte */
};

#define SCOCR3LL_struct _SFR_MEM8_STRUCT(0xed, struct __reg_SCOCR3LL)

#endif /* __ASSEMBLER__ */

  /* SCOCR3LL */

#define SCOCR3LL0                       0
#define SCOCR3LL1                       1
#define SCOCR3LL2                       2
#define SCOCR3LL3                       3
#define SCOCR3LL4                       4
#define SCOCR3LL5                       5
#define SCOCR3LL6                       6
#define SCOCR3LL7                       7

/* Symbol Counter Output Compare Register 3 LH-Byte */
#define SCOCR3LH                        _SFR_MEM8(0xEE)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR3LH {
        unsigned int scocr3lh : 8;	/* Symbol Counter Output Compare Register 3 LH-Byte */
};

#define SCOCR3LH_struct _SFR_MEM8_STRUCT(0xee, struct __reg_SCOCR3LH)

#endif /* __ASSEMBLER__ */

  /* SCOCR3LH */

#define SCOCR3LH0                       0
#define SCOCR3LH1                       1
#define SCOCR3LH2                       2
#define SCOCR3LH3                       3
#define SCOCR3LH4                       4
#define SCOCR3LH5                       5
#define SCOCR3LH6                       6
#define SCOCR3LH7                       7

/* Symbol Counter Output Compare Register 3 HL-Byte */
#define SCOCR3HL                        _SFR_MEM8(0xEF)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR3HL {
        unsigned int scocr3hl : 8;	/* Symbol Counter Output Compare Register 3 HL-Byte */
};

#define SCOCR3HL_struct _SFR_MEM8_STRUCT(0xef, struct __reg_SCOCR3HL)

#endif /* __ASSEMBLER__ */

  /* SCOCR3HL */

#define SCOCR3HL0                       0
#define SCOCR3HL1                       1
#define SCOCR3HL2                       2
#define SCOCR3HL3                       3
#define SCOCR3HL4                       4
#define SCOCR3HL5                       5
#define SCOCR3HL6                       6
#define SCOCR3HL7                       7

/* Symbol Counter Output Compare Register 3 HH-Byte */
#define SCOCR3HH                        _SFR_MEM8(0xF0)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR3HH {
        unsigned int scocr3hh : 8;	/* Symbol Counter Output Compare Register 3 HH-Byte */
};

#define SCOCR3HH_struct _SFR_MEM8_STRUCT(0xf0, struct __reg_SCOCR3HH)

#endif /* __ASSEMBLER__ */

  /* SCOCR3HH */

#define SCOCR3HH0                       0
#define SCOCR3HH1                       1
#define SCOCR3HH2                       2
#define SCOCR3HH3                       3
#define SCOCR3HH4                       4
#define SCOCR3HH5                       5
#define SCOCR3HH6                       6
#define SCOCR3HH7                       7

/* Symbol Counter Output Compare Register 2 LL-Byte */
#define SCOCR2LL                        _SFR_MEM8(0xF1)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR2LL {
        unsigned int scocr2ll : 8;	/* Symbol Counter Output Compare Register 2 LL-Byte */
};

#define SCOCR2LL_struct _SFR_MEM8_STRUCT(0xf1, struct __reg_SCOCR2LL)

#endif /* __ASSEMBLER__ */

  /* SCOCR2LL */

#define SCOCR2LL0                       0
#define SCOCR2LL1                       1
#define SCOCR2LL2                       2
#define SCOCR2LL3                       3
#define SCOCR2LL4                       4
#define SCOCR2LL5                       5
#define SCOCR2LL6                       6
#define SCOCR2LL7                       7

/* Symbol Counter Output Compare Register 2 LH-Byte */
#define SCOCR2LH                        _SFR_MEM8(0xF2)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR2LH {
        unsigned int scocr2lh : 8;	/* Symbol Counter Output Compare Register 2 LH-Byte */
};

#define SCOCR2LH_struct _SFR_MEM8_STRUCT(0xf2, struct __reg_SCOCR2LH)

#endif /* __ASSEMBLER__ */

  /* SCOCR2LH */

#define SCOCR2LH0                       0
#define SCOCR2LH1                       1
#define SCOCR2LH2                       2
#define SCOCR2LH3                       3
#define SCOCR2LH4                       4
#define SCOCR2LH5                       5
#define SCOCR2LH6                       6
#define SCOCR2LH7                       7

/* Symbol Counter Output Compare Register 2 HL-Byte */
#define SCOCR2HL                        _SFR_MEM8(0xF3)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR2HL {
        unsigned int scocr2hl : 8;	/* Symbol Counter Output Compare Register 2 HL-Byte */
};

#define SCOCR2HL_struct _SFR_MEM8_STRUCT(0xf3, struct __reg_SCOCR2HL)

#endif /* __ASSEMBLER__ */

  /* SCOCR2HL */

#define SCOCR2HL0                       0
#define SCOCR2HL1                       1
#define SCOCR2HL2                       2
#define SCOCR2HL3                       3
#define SCOCR2HL4                       4
#define SCOCR2HL5                       5
#define SCOCR2HL6                       6
#define SCOCR2HL7                       7

/* Symbol Counter Output Compare Register 2 HH-Byte */
#define SCOCR2HH                        _SFR_MEM8(0xF4)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR2HH {
        unsigned int scocr2hh : 8;	/* Symbol Counter Output Compare Register 2 HH-Byte */
};

#define SCOCR2HH_struct _SFR_MEM8_STRUCT(0xf4, struct __reg_SCOCR2HH)

