arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* SCOCR2HH */

#define SCOCR2HH0                       0
#define SCOCR2HH1                       1
#define SCOCR2HH2                       2
#define SCOCR2HH3                       3
#define SCOCR2HH4                       4
#define SCOCR2HH5                       5
#define SCOCR2HH6                       6
#define SCOCR2HH7                       7

/* Symbol Counter Output Compare Register 1 LL-Byte */
#define SCOCR1LL                        _SFR_MEM8(0xF5)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR1LL {
        unsigned int scocr1ll : 8;	/* Symbol Counter Output Compare Register 1 LL-Byte */
};

#define SCOCR1LL_struct _SFR_MEM8_STRUCT(0xf5, struct __reg_SCOCR1LL)

#endif /* __ASSEMBLER__ */

  /* SCOCR1LL */

#define SCOCR1LL0                       0
#define SCOCR1LL1                       1
#define SCOCR1LL2                       2
#define SCOCR1LL3                       3
#define SCOCR1LL4                       4
#define SCOCR1LL5                       5
#define SCOCR1LL6                       6
#define SCOCR1LL7                       7

/* Symbol Counter Output Compare Register 1 LH-Byte */
#define SCOCR1LH                        _SFR_MEM8(0xF6)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR1LH {
        unsigned int scocr1lh : 8;	/* Symbol Counter Output Compare Register 1 LH-Byte */
};

#define SCOCR1LH_struct _SFR_MEM8_STRUCT(0xf6, struct __reg_SCOCR1LH)

#endif /* __ASSEMBLER__ */

  /* SCOCR1LH */

#define SCOCR1LH0                       0
#define SCOCR1LH1                       1
#define SCOCR1LH2                       2
#define SCOCR1LH3                       3
#define SCOCR1LH4                       4
#define SCOCR1LH5                       5
#define SCOCR1LH6                       6
#define SCOCR1LH7                       7

/* Symbol Counter Output Compare Register 1 HL-Byte */
#define SCOCR1HL                        _SFR_MEM8(0xF7)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR1HL {
        unsigned int scocr1hl : 8;	/* Symbol Counter Output Compare Register 1 HL-Byte */
};

#define SCOCR1HL_struct _SFR_MEM8_STRUCT(0xf7, struct __reg_SCOCR1HL)

#endif /* __ASSEMBLER__ */

  /* SCOCR1HL */

#define SCOCR1HL0                       0
#define SCOCR1HL1                       1
#define SCOCR1HL2                       2
#define SCOCR1HL3                       3
#define SCOCR1HL4                       4
#define SCOCR1HL5                       5
#define SCOCR1HL6                       6
#define SCOCR1HL7                       7

/* Symbol Counter Output Compare Register 1 HH-Byte */
#define SCOCR1HH                        _SFR_MEM8(0xF8)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SCOCR1HH {
        unsigned int scocr1hh : 8;	/* Symbol Counter Output Compare Register 1 HH-Byte */
};

#define SCOCR1HH_struct _SFR_MEM8_STRUCT(0xf8, struct __reg_SCOCR1HH)

#endif /* __ASSEMBLER__ */

  /* SCOCR1HH */

#define SCOCR1HH0                       0
#define SCOCR1HH1                       1
#define SCOCR1HH2                       2
#define SCOCR1HH3                       3
#define SCOCR1HH4                       4
#define SCOCR1HH5                       5
#define SCOCR1HH6                       6
#define SCOCR1HH7                       7

/* Timer/Counter5 Control Register A */
#define TCCR5A                          _SFR_MEM8(0x120)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR5A {
        unsigned int wgm5 : 2;	/* Waveform Generation Mode */
        unsigned int com5c : 2;	/* Compare Output Mode for Channel C */
        unsigned int com5b : 2;	/* Compare Output Mode for Channel B */
        unsigned int com5a : 2;	/* Compare Output Mode for Channel A */
};

#define TCCR5A_struct _SFR_MEM8_STRUCT(0x120, struct __reg_TCCR5A)

#endif /* __ASSEMBLER__ */

  /* TCCR5A */

#define WGM50                           0
#define WGM51                           1
#define COM5C0                          2
#define COM5C1                          3
#define COM5B0                          4
#define COM5B1                          5
#define COM5A0                          6
#define COM5A1                          7

/* Timer/Counter5 Control Register B */
#define TCCR5B                          _SFR_MEM8(0x121)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR5B {
        unsigned int cs5 : 3;	/* Clock Select */
        unsigned int wgm5 : 2;	/* Waveform Generation Mode */
        unsigned int : 1;
        unsigned int ices5 : 1;	/* Input Capture 5 Edge Select */
        unsigned int icnc5 : 1;	/* Input Capture 5 Noise Canceller */
};

#define TCCR5B_struct _SFR_MEM8_STRUCT(0x121, struct __reg_TCCR5B)

#endif /* __ASSEMBLER__ */

  /* TCCR5B */

#define CS50                            0
#define CS51                            1
#define CS52                            2
#define WGM52                           3
#define WGM53                           4
#define ICES5                           6
#define ICNC5                           7

/* Timer/Counter5 Control Register C */
#define TCCR5C                          _SFR_MEM8(0x122)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TCCR5C {
        unsigned int : 5;
        unsigned int foc5c : 1;	/* Force Output Compare for Channel C */
        unsigned int foc5b : 1;	/* Force Output Compare for Channel B */
        unsigned int foc5a : 1;	/* Force Output Compare for Channel A */
};

#define TCCR5C_struct _SFR_MEM8_STRUCT(0x122, struct __reg_TCCR5C)

#endif /* __ASSEMBLER__ */

  /* TCCR5C */

#define FOC5C                           5
#define FOC5B                           6
#define FOC5A                           7

/* Timer/Counter5  Bytes */
#define TCNT5                           _SFR_MEM16(0x124)
#define TCNT5L                          _SFR_MEM8(0x124)
#define TCNT5H                          _SFR_MEM8(0x125)

/* Timer/Counter5 Input Capture Register  Bytes */
#define ICR5                            _SFR_MEM16(0x126)
#define ICR5L                           _SFR_MEM8(0x126)
#define ICR5H                           _SFR_MEM8(0x127)

