arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
/* Timer/Counter5 Output Compare Register A  Bytes */
#define OCR5A                           _SFR_MEM16(0x128)
#define OCR5AL                          _SFR_MEM8(0x128)
#define OCR5AH                          _SFR_MEM8(0x129)

/* Timer/Counter5 Output Compare Register B  Bytes */
#define OCR5B                           _SFR_MEM16(0x12A)
#define OCR5BL                          _SFR_MEM8(0x12A)
#define OCR5BH                          _SFR_MEM8(0x12B)

/* Timer/Counter5 Output Compare Register C  Bytes */
#define OCR5C                           _SFR_MEM16(0x12C)
#define OCR5CL                          _SFR_MEM8(0x12C)
#define OCR5CH                          _SFR_MEM8(0x12D)

/* Low Leakage Voltage Regulator Control Register */
#define LLCR                            _SFR_MEM8(0x12F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_LLCR {
        unsigned int llencal : 1;	/* Enable Automatic Calibration */
        unsigned int llshort : 1;	/* Short Lower Calibration Circuit */
        unsigned int lltco : 1;	/* Temperature Coefficient of Current Source */
        unsigned int llcal : 1;	/* Calibration Active */
        unsigned int llcomp : 1;	/* Comparator Output */
        unsigned int lldone : 1;	/* Calibration Done */
        unsigned int : 2;
};

#define LLCR_struct _SFR_MEM8_STRUCT(0x12f, struct __reg_LLCR)

#endif /* __ASSEMBLER__ */

  /* LLCR */

#define LLENCAL                         0
#define LLSHORT                         1
#define LLTCO                           2
#define LLCAL                           3
#define LLCOMP                          4
#define LLDONE                          5

/* Low Leakage Voltage Regulator Data Register (Low-Byte) */
#define LLDRL                           _SFR_MEM8(0x130)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_LLDRL {
        unsigned int lldrl : 4;	/* Low-Byte Data Register Bits */
        unsigned int : 4;
};

#define LLDRL_struct _SFR_MEM8_STRUCT(0x130, struct __reg_LLDRL)

#endif /* __ASSEMBLER__ */

  /* LLDRL */

#define LLDRL0                          0
#define LLDRL1                          1
#define LLDRL2                          2
#define LLDRL3                          3

/* Low Leakage Voltage Regulator Data Register (High-Byte) */
#define LLDRH                           _SFR_MEM8(0x131)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_LLDRH {
        unsigned int lldrh : 5;	/* High-Byte Data Register Bits */
        unsigned int : 3;
};

#define LLDRH_struct _SFR_MEM8_STRUCT(0x131, struct __reg_LLDRH)

#endif /* __ASSEMBLER__ */

  /* LLDRH */

#define LLDRH0                          0
#define LLDRH1                          1
#define LLDRH2                          2
#define LLDRH3                          3
#define LLDRH4                          4

/* Data Retention Configuration Register of SRAM 3 */
#define DRTRAM3                         _SFR_MEM8(0x132)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DRTRAM3 {
        unsigned int : 4;
        unsigned int endrt : 1;	/* Enable SRAM Data Retention */
        unsigned int drtswok : 1;	/* DRT Switch OK */
        unsigned int : 2;
};

#define DRTRAM3_struct _SFR_MEM8_STRUCT(0x132, struct __reg_DRTRAM3)

#endif /* __ASSEMBLER__ */

  /* DRTRAM3 */

#define ENDRT                           4
#define DRTSWOK                         5

/* Data Retention Configuration Register of SRAM 2 */
#define DRTRAM2                         _SFR_MEM8(0x133)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DRTRAM2 {
        unsigned int : 4;
        unsigned int endrt : 1;	/* Enable SRAM Data Retention */
        unsigned int drtswok : 1;	/* DRT Switch OK */
        unsigned int : 2;
};

#define DRTRAM2_struct _SFR_MEM8_STRUCT(0x133, struct __reg_DRTRAM2)

#endif /* __ASSEMBLER__ */

  /* DRTRAM2 */

#define ENDRT                           4
#define DRTSWOK                         5

/* Data Retention Configuration Register of SRAM 1 */
#define DRTRAM1                         _SFR_MEM8(0x134)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DRTRAM1 {
        unsigned int : 4;
        unsigned int endrt : 1;	/* Enable SRAM Data Retention */
        unsigned int drtswok : 1;	/* DRT Switch OK */
        unsigned int : 2;
};

#define DRTRAM1_struct _SFR_MEM8_STRUCT(0x134, struct __reg_DRTRAM1)

#endif /* __ASSEMBLER__ */

  /* DRTRAM1 */

#define ENDRT                           4
#define DRTSWOK                         5

/* Data Retention Configuration Register of SRAM 0 */
#define DRTRAM0                         _SFR_MEM8(0x135)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DRTRAM0 {
        unsigned int : 4;
        unsigned int endrt : 1;	/* Enable SRAM Data Retention */
        unsigned int drtswok : 1;	/* DRT Switch OK */
        unsigned int : 2;
};

#define DRTRAM0_struct _SFR_MEM8_STRUCT(0x135, struct __reg_DRTRAM0)

#endif /* __ASSEMBLER__ */

  /* DRTRAM0 */

#define ENDRT                           4
#define DRTSWOK                         5

/* Port Driver Strength Register 0 */
#define DPDS0                           _SFR_MEM8(0x136)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_DPDS0 {
        unsigned int pbdrv : 2;	/* Driver Strength Port B */
        unsigned int pddrv : 2;	/* Driver Strength Port D */
        unsigned int pedrv : 2;	/* Driver Strength Port E */
        unsigned int pfdrv : 2;	/* Driver Strength Port F */
};

#define DPDS0_struct _SFR_MEM8_STRUCT(0x136, struct __reg_DPDS0)

#endif /* __ASSEMBLER__ */

  /* DPDS0 */

#define PBDRV0                          0
#define PBDRV1                          1
#define PDDRV0                          2
#define PDDRV1                          3
#define PEDRV0                          4
#define PEDRV1                          5
#define PFDRV0                          6
#define PFDRV1                          7

/* Port Driver Strength Register 1 */
#define DPDS1                           _SFR_MEM8(0x137)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

