arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
struct __reg_DPDS1 {
        unsigned int pgdrv : 2;	/* Driver Strength Port G */
        unsigned int : 6;
};

#define DPDS1_struct _SFR_MEM8_STRUCT(0x137, struct __reg_DPDS1)

#endif /* __ASSEMBLER__ */

  /* DPDS1 */

#define PGDRV0                          0
#define PGDRV1                          1

/* Transceiver Pin Register */
#define TRXPR                           _SFR_MEM8(0x139)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TRXPR {
        unsigned int trxrst : 1;	/* Force Transceiver Reset */
        unsigned int slptr : 1;	/* Multi-purpose Transceiver Control Bit */
        unsigned int : 6;
};

#define TRXPR_struct _SFR_MEM8_STRUCT(0x139, struct __reg_TRXPR)

#endif /* __ASSEMBLER__ */

  /* TRXPR */

#define TRXRST                          0
#define SLPTR                           1

/* AES Control Register */
#define AES_CTRL                        _SFR_MEM8(0x13C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_AES_CTRL {
        unsigned int : 2;
        unsigned int aes_im : 1;	/* AES Interrupt Enable */
        unsigned int aes_dir : 1;	/* Set AES Operation Direction */
        unsigned int : 1;
        unsigned int aes_mode : 1;	/* Set AES Operation Mode */
        unsigned int : 1;
        unsigned int aes_request : 1;	/* Request AES Operation. */
};

#define AES_CTRL_struct _SFR_MEM8_STRUCT(0x13c, struct __reg_AES_CTRL)

/* symbolic names */

#define AES_DIR_ENC                     0
#define AES_DIR_DEC                     1
#define AES_MODE_ECB                    0
#define AES_MODE_CBC                    1

#endif /* __ASSEMBLER__ */

  /* AES_CTRL */

#define AES_IM                          2
#define AES_DIR                         3
#define AES_MODE                        5
#define AES_REQUEST                     7

/* AES Status Register */
#define AES_STATUS                      _SFR_MEM8(0x13D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_AES_STATUS {
        unsigned int aes_done : 1;	/* AES Operation Finished with Success */
        unsigned int : 6;
        unsigned int aes_er : 1;	/* AES Operation Finished with Error */
};

#define AES_STATUS_struct _SFR_MEM8_STRUCT(0x13d, struct __reg_AES_STATUS)

#endif /* __ASSEMBLER__ */

  /* AES_STATUS */

#define AES_DONE                        0
#define AES_ER                          7

/* AES Plain and Cipher Text Buffer Register */
#define AES_STATE                       _SFR_MEM8(0x13E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_AES_STATE {
        unsigned int aes_state : 8;	/* AES Plain and Cipher Text Buffer */
};

#define AES_STATE_struct _SFR_MEM8_STRUCT(0x13e, struct __reg_AES_STATE)

#endif /* __ASSEMBLER__ */

  /* AES_STATE */

#define AES_STATE0                      0
#define AES_STATE1                      1
#define AES_STATE2                      2
#define AES_STATE3                      3
#define AES_STATE4                      4
#define AES_STATE5                      5
#define AES_STATE6                      6
#define AES_STATE7                      7

/* AES Encryption and Decryption Key Buffer Register */
#define AES_KEY                         _SFR_MEM8(0x13F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_AES_KEY {
        unsigned int aes_key : 8;	/* AES Encryption/Decryption Key Buffer */
};

#define AES_KEY_struct _SFR_MEM8_STRUCT(0x13f, struct __reg_AES_KEY)

#endif /* __ASSEMBLER__ */

  /* AES_KEY */

#define AES_KEY0                        0
#define AES_KEY1                        1
#define AES_KEY2                        2
#define AES_KEY3                        3
#define AES_KEY4                        4
#define AES_KEY5                        5
#define AES_KEY6                        6
#define AES_KEY7                        7

/* Transceiver Status Register */
#define TRX_STATUS                      _SFR_MEM8(0x141)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TRX_STATUS {
        unsigned int trx_status : 5;	/* Transceiver Main Status */
        unsigned int tst_status : 1;	/* Test mode status */
        unsigned int cca_status : 1;	/* CCA Status Result */
        unsigned int cca_done : 1;	/* CCA Algorithm Status */
};

#define TRX_STATUS_struct _SFR_MEM8_STRUCT(0x141, struct __reg_TRX_STATUS)

/* symbolic names */

#define P_ON                            0
#define BUSY_RX                         1
#define BUSY_TX                         2
#define RX_ON                           6
#define TRX_OFF                         8
#define PLL_ON                          9
#define SLEEP                           15
#define BUSY_RX_AACK                    17
#define BUSY_TX_ARET                    18
#define RX_AACK_ON                      22
#define TX_ARET_ON                      25
#define STATE_TRANSITION_IN_PROGRESS    31
#define TST_DISABLED                    0
#define TST_ENABLED                     1
#define CCA_BUSY                        0
#define CCA_IDLE                        1
#define CCA_NOT_FIN                     0
#define CCA_FIN                         1

#endif /* __ASSEMBLER__ */

  /* TRX_STATUS */

#define TRX_STATUS0                     0
#define TRX_STATUS1                     1
#define TRX_STATUS2                     2
#define TRX_STATUS3                     3
#define TRX_STATUS4                     4
#define TST_STATUS                      5
#define CCA_STATUS                      6
#define CCA_DONE                        7

/* Transceiver State Control Register */
#define TRX_STATE                       _SFR_MEM8(0x142)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TRX_STATE {
        unsigned int trx_cmd : 5;	/* State Control Command */
        unsigned int trac_status : 3;	/* Transaction Status */
};

#define TRX_STATE_struct _SFR_MEM8_STRUCT(0x142, struct __reg_TRX_STATE)

/* symbolic names */

#define CMD_NOP                         0
#define CMD_TX_START                    2
#define CMD_FORCE_TRX_OFF               3
#define CMD_FORCE_PLL_ON                4
#define CMD_RX_ON                       6
#define CMD_TRX_OFF                     8
#define CMD_PLL_ON                      9
#define CMD_RX_AACK_ON                  22
#define CMD_TX_ARET_ON                  25
#define TRAC_SUCCESS                    0
#define TRAC_SUCCESS_DATA_PENDING       1
#define TRAC_SUCCESS_WAIT_FOR_ACK       2
#define TRAC_CHANNEL_ACCESS_FAILURE     3
#define TRAC_NO_ACK                     5
#define TRAC_INVALID                    7

