arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* TRX_STATE */

#define TRX_CMD0                        0
#define TRX_CMD1                        1
#define TRX_CMD2                        2
#define TRX_CMD3                        3
#define TRX_CMD4                        4
#define TRAC_STATUS0                    5
#define TRAC_STATUS1                    6
#define TRAC_STATUS2                    7

/* Reserved */
#define TRX_CTRL_0                      _SFR_MEM8(0x143)

/* Transceiver Control Register 1 */
#define TRX_CTRL_1                      _SFR_MEM8(0x144)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TRX_CTRL_1 {
        unsigned int : 5;
        unsigned int tx_auto_crc_on : 1;	/* Enable Automatic CRC Calculation */
        unsigned int irq_2_ext_en : 1;	/* Connect Frame Start IRQ to TC1 */
        unsigned int pa_ext_en : 1;	/* External PA support enable */
};

#define TRX_CTRL_1_struct _SFR_MEM8_STRUCT(0x144, struct __reg_TRX_CTRL_1)

#endif /* __ASSEMBLER__ */

  /* TRX_CTRL_1 */

#define TX_AUTO_CRC_ON                  5
#define IRQ_2_EXT_EN                    6
#define PA_EXT_EN                       7

/* Transceiver Transmit Power Control Register */
#define PHY_TX_PWR                      _SFR_MEM8(0x145)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PHY_TX_PWR {
        unsigned int tx_pwr : 4;	/* Transmit Power Setting */
        unsigned int pa_lt : 2;	/* Power Amplifier Lead Time */
        unsigned int pa_buf_lt : 2;	/* Power Amplifier Buffer Lead Time */
};

#define PHY_TX_PWR_struct _SFR_MEM8_STRUCT(0x145, struct __reg_PHY_TX_PWR)

/* symbolic names */

#define PA_LT_2US                       0
#define PA_LT_4US                       1
#define PA_LT_6US                       2
#define PA_LT_8US                       3
#define PA_BUF_LT_0US                   0
#define PA_BUF_LT_2US                   1
#define PA_BUF_LT_4US                   2
#define PA_BUF_LT_6US                   3

#endif /* __ASSEMBLER__ */

  /* PHY_TX_PWR */

#define TX_PWR0                         0
#define TX_PWR1                         1
#define TX_PWR2                         2
#define TX_PWR3                         3
#define PA_LT0                          4
#define PA_LT1                          5
#define PA_BUF_LT0                      6
#define PA_BUF_LT1                      7

/* Receiver Signal Strength Indicator Register */
#define PHY_RSSI                        _SFR_MEM8(0x146)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PHY_RSSI {
        unsigned int rssi : 5;	/* Receiver Signal Strength Indicator */
        unsigned int rnd_value : 2;	/* Random Value */
        unsigned int rx_crc_valid : 1;	/* Received Frame CRC Status */
};

#define PHY_RSSI_struct _SFR_MEM8_STRUCT(0x146, struct __reg_PHY_RSSI)

/* symbolic names */

#define RSSI_MIN                        0
#define RSSI_MIN_PLUS_3dB               1
#define RSSI_MAX                        28
#define CRC_INVALID                     0
#define CRC_VALID                       1

#endif /* __ASSEMBLER__ */

  /* PHY_RSSI */

#define RSSI0                           0
#define RSSI1                           1
#define RSSI2                           2
#define RSSI3                           3
#define RSSI4                           4
#define RND_VALUE0                      5
#define RND_VALUE1                      6
#define RX_CRC_VALID                    7

/* Transceiver Energy Detection Level Register */
#define PHY_ED_LEVEL                    _SFR_MEM8(0x147)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PHY_ED_LEVEL {
        unsigned int ed_level : 8;	/* Energy Detection Level */
};

#define PHY_ED_LEVEL_struct _SFR_MEM8_STRUCT(0x147, struct __reg_PHY_ED_LEVEL)

/* symbolic names */

#define ED_MIN                          0
#define ED_MIN_PLUS_1dB                 1
#define ED_MAX                          84
#define ED_RESET                        255

#endif /* __ASSEMBLER__ */

  /* PHY_ED_LEVEL */

#define ED_LEVEL0                       0
#define ED_LEVEL1                       1
#define ED_LEVEL2                       2
#define ED_LEVEL3                       3
#define ED_LEVEL4                       4
#define ED_LEVEL5                       5
#define ED_LEVEL6                       6
#define ED_LEVEL7                       7

/* Transceiver Clear Channel Assessment (CCA) Control Register */
#define PHY_CC_CCA                      _SFR_MEM8(0x148)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PHY_CC_CCA {
        unsigned int channel : 5;	/* RX/TX Channel Selection */
        unsigned int cca_mode : 2;	/* Select CCA Measurement Mode */
        unsigned int cca_request : 1;	/* Manual CCA Measurement Request */
};

#define PHY_CC_CCA_struct _SFR_MEM8_STRUCT(0x148, struct __reg_PHY_CC_CCA)

/* symbolic names */

#define F_2405MHZ                       11
#define F_2410MHZ                       12
#define F_2415MHZ                       13
#define F_2420MHZ                       14
#define F_2425MHZ                       15
#define F_2430MHZ                       16
#define F_2435MHZ                       17
#define F_2440MHZ                       18
#define F_2445MHZ                       19
#define F_2450MHZ                       20
#define F_2455MHZ                       21
#define F_2460MHZ                       22
#define F_2465MHZ                       23
#define F_2470MHZ                       24
#define F_2475MHZ                       25
#define F_2480MHZ                       26
#define CCA_CS_OR_ED                    0
#define CCA_ED                          1
#define CCA_CS                          2
#define CCA_CS_AND_ED                   3

#endif /* __ASSEMBLER__ */

  /* PHY_CC_CCA */

#define CHANNEL0                        0
#define CHANNEL1                        1
#define CHANNEL2                        2
#define CHANNEL3                        3
#define CHANNEL4                        4
#define CCA_MODE0                       5
#define CCA_MODE1                       6
#define CCA_REQUEST                     7

