arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
/* Transceiver CCA Threshold Setting Register */
#define CCA_THRES                       _SFR_MEM8(0x149)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_CCA_THRES {
        unsigned int cca_ed_thres : 4;	/* ED Threshold Level for CCA Measurement */
        unsigned int cca_cs_thres : 4;	/* CS Threshold Level for CCA Measurement */
};

#define CCA_THRES_struct _SFR_MEM8_STRUCT(0x149, struct __reg_CCA_THRES)

#endif /* __ASSEMBLER__ */

  /* CCA_THRES */

#define CCA_ED_THRES0                   0
#define CCA_ED_THRES1                   1
#define CCA_ED_THRES2                   2
#define CCA_ED_THRES3                   3
#define CCA_CS_THRES0                   4
#define CCA_CS_THRES1                   5
#define CCA_CS_THRES2                   6
#define CCA_CS_THRES3                   7

/* Transceiver Receive Control Register */
#define RX_CTRL                         _SFR_MEM8(0x14A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_RX_CTRL {
        unsigned int pdt_thres : 4;	/* Receiver Sensitivity Control */
        unsigned int : 4;
};

#define RX_CTRL_struct _SFR_MEM8_STRUCT(0x14a, struct __reg_RX_CTRL)

/* symbolic names */

#define PDT_THRES_ANT_DIV_OFF           7
#define PDT_THRES_ANT_DIV_ON            3

#endif /* __ASSEMBLER__ */

  /* RX_CTRL */

#define PDT_THRES0                      0
#define PDT_THRES1                      1
#define PDT_THRES2                      2
#define PDT_THRES3                      3

/* Start of Frame Delimiter Value Register */
#define SFD_VALUE                       _SFR_MEM8(0x14B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SFD_VALUE {
        unsigned int sfd_value : 8;	/* Start of Frame Delimiter Value */
};

#define SFD_VALUE_struct _SFR_MEM8_STRUCT(0x14b, struct __reg_SFD_VALUE)

/* symbolic names */

#define IEEE_SFD                        167

#endif /* __ASSEMBLER__ */

  /* SFD_VALUE */

#define SFD_VALUE0                      0
#define SFD_VALUE1                      1
#define SFD_VALUE2                      2
#define SFD_VALUE3                      3
#define SFD_VALUE4                      4
#define SFD_VALUE5                      5
#define SFD_VALUE6                      6
#define SFD_VALUE7                      7

/* Transceiver Control Register 2 */
#define TRX_CTRL_2                      _SFR_MEM8(0x14C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TRX_CTRL_2 {
        unsigned int oqpsk_data_rate : 2;	/* Data Rate Selection */
        unsigned int : 5;
        unsigned int rx_safe_mode : 1;	/* RX Safe Mode */
};

#define TRX_CTRL_2_struct _SFR_MEM8_STRUCT(0x14c, struct __reg_TRX_CTRL_2)

/* symbolic names */

#define RATE_250KB                      0
#define RATE_500KB                      1
#define RATE_1000KB                     2
#define RATE_2000KB                     3

#endif /* __ASSEMBLER__ */

  /* TRX_CTRL_2 */

#define OQPSK_DATA_RATE0                0
#define OQPSK_DATA_RATE1                1
#define RX_SAFE_MODE                    7

/* Antenna Diversity Control Register */
#define ANT_DIV                         _SFR_MEM8(0x14D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_ANT_DIV {
        unsigned int ant_ctrl : 2;	/* Static Antenna Diversity Switch Control */
        unsigned int ant_ext_sw_en : 1;	/* Enable External Antenna Switch Control */
        unsigned int ant_div_en : 1;	/* Enable Antenna Diversity */
        unsigned int : 3;
        unsigned int ant_sel : 1;	/* Antenna Diversity Antenna Status */
};

#define ANT_DIV_struct _SFR_MEM8_STRUCT(0x14d, struct __reg_ANT_DIV)

/* symbolic names */

#define ANT_1                           1
#define ANT_0                           2
#define ANT_RESET                       3
#define ANT_DIV_EXT_SW_DIS              0
#define ANT_DIV_EXT_SW_EN               1
#define ANTENNA_0                       0
#define ANTENNA_1                       1

#endif /* __ASSEMBLER__ */

  /* ANT_DIV */

#define ANT_CTRL0                       0
#define ANT_CTRL1                       1
#define ANT_EXT_SW_EN                   2
#define ANT_DIV_EN                      3
#define ANT_SEL                         7

/* Transceiver Interrupt Enable Register */
#define IRQ_MASK                        _SFR_MEM8(0x14E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IRQ_MASK {
        unsigned int pll_lock_en : 1;	/* PLL Lock Interrupt Enable */
        unsigned int pll_unlock_en : 1;	/* PLL Unlock Interrupt Enable */
        unsigned int rx_start_en : 1;	/* RX_START Interrupt Enable */
        unsigned int rx_end_en : 1;	/* RX_END Interrupt Enable */
        unsigned int cca_ed_done_en : 1;	/* End of ED Measurement Interrupt Enable */
        unsigned int ami_en : 1;	/* Address Match Interrupt Enable */
        unsigned int tx_end_en : 1;	/* TX_END Interrupt Enable */
        unsigned int awake_en : 1;	/* Awake Interrupt Enable */
};

#define IRQ_MASK_struct _SFR_MEM8_STRUCT(0x14e, struct __reg_IRQ_MASK)

#endif /* __ASSEMBLER__ */

  /* IRQ_MASK */

#define PLL_LOCK_EN                     0
#define PLL_UNLOCK_EN                   1
#define RX_START_EN                     2
#define RX_END_EN                       3
#define CCA_ED_DONE_EN                  4
#define AMI_EN                          5
#define TX_END_EN                       6
#define AWAKE_EN                        7

/* Transceiver Interrupt Status Register */
#define IRQ_STATUS                      _SFR_MEM8(0x14F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IRQ_STATUS {
        unsigned int pll_lock : 1;	/* PLL Lock Interrupt Status */
        unsigned int pll_unlock : 1;	/* PLL Unlock Interrupt Status */
        unsigned int rx_start : 1;	/* RX_START Interrupt Status */
        unsigned int rx_end : 1;	/* RX_END Interrupt Status */
        unsigned int cca_ed_done : 1;	/* End of ED Measurement Interrupt Status */
        unsigned int ami : 1;	/* Address Match Interrupt Status */
        unsigned int tx_end : 1;	/* TX_END Interrupt Status */
        unsigned int awake : 1;	/* Awake Interrupt Status */
};

#define IRQ_STATUS_struct _SFR_MEM8_STRUCT(0x14f, struct __reg_IRQ_STATUS)

