arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* IRQ_STATUS */

#define PLL_LOCK                        0
#define PLL_UNLOCK                      1
#define RX_START                        2
#define RX_END                          3
#define CCA_ED_DONE                     4
#define AMI                             5
#define TX_END                          6
#define AWAKE                           7

/* Voltage Regulator Control and Status Register */
#define VREG_CTRL                       _SFR_MEM8(0x150)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_VREG_CTRL {
        unsigned int : 2;
        unsigned int dvdd_ok : 1;	/* DVDD Supply Voltage Valid */
        unsigned int dvreg_ext : 1;	/* Use External DVDD Regulator */
        unsigned int : 2;
        unsigned int avdd_ok : 1;	/* AVDD Supply Voltage Valid */
        unsigned int avreg_ext : 1;	/* Use External AVDD Regulator */
};

#define VREG_CTRL_struct _SFR_MEM8_STRUCT(0x150, struct __reg_VREG_CTRL)

/* symbolic names */

#define DVDD_INT                        0
#define DVDD_EXT                        1
#define AVDD_INT                        0
#define AVDD_EXT                        1

#endif /* __ASSEMBLER__ */

  /* VREG_CTRL */

#define DVDD_OK                         2
#define DVREG_EXT                       3
#define AVDD_OK                         6
#define AVREG_EXT                       7

/* Battery Monitor Control and Status Register */
#define BATMON                          _SFR_MEM8(0x151)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_BATMON {
        unsigned int batmon_vth : 4;	/* Battery Monitor Threshold Voltage */
        unsigned int batmon_hr : 1;	/* Battery Monitor Voltage Range */
        unsigned int batmon_ok : 1;	/* Battery Monitor Status */
        unsigned int bat_low_en : 1;	/* Battery Monitor Interrupt Enable */
        unsigned int bat_low : 1;	/* Battery Monitor Interrupt Status */
};

#define BATMON_struct _SFR_MEM8_STRUCT(0x151, struct __reg_BATMON)

/* symbolic names */

#define BATMON_HR_DIS                   0
#define BATMON_HR_EN                    1

#endif /* __ASSEMBLER__ */

  /* BATMON */

#define BATMON_VTH0                     0
#define BATMON_VTH1                     1
#define BATMON_VTH2                     2
#define BATMON_VTH3                     3
#define BATMON_HR                       4
#define BATMON_OK                       5
#define BAT_LOW_EN                      6
#define BAT_LOW                         7

/* Crystal Oscillator Control Register */
#define XOSC_CTRL                       _SFR_MEM8(0x152)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_XOSC_CTRL {
        unsigned int xtal_trim : 4;	/* Crystal Oscillator Load Capacitance Trimming */
        unsigned int xtal_mode : 4;	/* Crystal Oscillator Operating Mode */
};

#define XOSC_CTRL_struct _SFR_MEM8_STRUCT(0x152, struct __reg_XOSC_CTRL)

/* symbolic names */

#define XTAL_TRIM_MIN                   0
#define XTAL_TRIM_MAX                   15

#endif /* __ASSEMBLER__ */

  /* XOSC_CTRL */

#define XTAL_TRIM0                      0
#define XTAL_TRIM1                      1
#define XTAL_TRIM2                      2
#define XTAL_TRIM3                      3
#define XTAL_MODE0                      4
#define XTAL_MODE1                      5
#define XTAL_MODE2                      6
#define XTAL_MODE3                      7

/* Transceiver Receiver Sensitivity Control Register */
#define RX_SYN                          _SFR_MEM8(0x155)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_RX_SYN {
        unsigned int rx_pdt_level : 4;	/* Reduce Receiver Sensitivity */
        unsigned int : 3;
        unsigned int rx_pdt_dis : 1;	/* Prevent Frame Reception */
};

#define RX_SYN_struct _SFR_MEM8_STRUCT(0x155, struct __reg_RX_SYN)

/* symbolic names */

#define RX_PDT_LEVEL_MIN                0
#define RX_PDT_LEVEL_MAX                15

#endif /* __ASSEMBLER__ */

  /* RX_SYN */

#define RX_PDT_LEVEL0                   0
#define RX_PDT_LEVEL1                   1
#define RX_PDT_LEVEL2                   2
#define RX_PDT_LEVEL3                   3
#define RX_PDT_DIS                      7

/* Transceiver Acknowledgment Frame Control Register 1 */
#define XAH_CTRL_1                      _SFR_MEM8(0x157)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_XAH_CTRL_1 {
        unsigned int : 1;
        unsigned int aack_prom_mode : 1;	/* Enable Promiscuous Mode */
        unsigned int aack_ack_time : 1;	/* Reduce Acknowledgment Time */
        unsigned int : 1;
        unsigned int aack_upld_res_ft : 1;	/* Process Reserved Frames */
        unsigned int aack_fltr_res_ft : 1;	/* Filter Reserved Frames */
        unsigned int : 2;
};

#define XAH_CTRL_1_struct _SFR_MEM8_STRUCT(0x157, struct __reg_XAH_CTRL_1)

/* symbolic names */

#define AACK_ACK_TIME_12_SYM            0
#define AACK_ACK_TIME_2_SYM             1

#endif /* __ASSEMBLER__ */

  /* XAH_CTRL_1 */

#define AACK_PROM_MODE                  1
#define AACK_ACK_TIME                   2
#define AACK_UPLD_RES_FT                4
#define AACK_FLTR_RES_FT                5

/* Transceiver Filter Tuning Control Register */
#define FTN_CTRL                        _SFR_MEM8(0x158)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_FTN_CTRL {
        unsigned int : 7;
        unsigned int ftn_start : 1;	/* Start Calibration Loop of Filter Tuning Network */
};

#define FTN_CTRL_struct _SFR_MEM8_STRUCT(0x158, struct __reg_FTN_CTRL)

#endif /* __ASSEMBLER__ */

  /* FTN_CTRL */

#define FTN_START                       7

/* Transceiver Center Frequency Calibration Control Register */
#define PLL_CF                          _SFR_MEM8(0x15A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PLL_CF {
        unsigned int : 7;
        unsigned int pll_cf_start : 1;	/* Start Center Frequency Calibration */
};

