arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#define PLL_CF_struct _SFR_MEM8_STRUCT(0x15a, struct __reg_PLL_CF)

#endif /* __ASSEMBLER__ */

  /* PLL_CF */

#define PLL_CF_START                    7

/* Transceiver Delay Cell Calibration Control Register */
#define PLL_DCU                         _SFR_MEM8(0x15B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PLL_DCU {
        unsigned int : 7;
        unsigned int pll_dcu_start : 1;	/* Start Delay Cell Calibration */
};

#define PLL_DCU_struct _SFR_MEM8_STRUCT(0x15b, struct __reg_PLL_DCU)

#endif /* __ASSEMBLER__ */

  /* PLL_DCU */

#define PLL_DCU_START                   7

/* Device Identification Register (Part Number) */
#define PART_NUM                        _SFR_MEM8(0x15C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PART_NUM {
        unsigned int part_num : 8;	/* Part Number */
};

#define PART_NUM_struct _SFR_MEM8_STRUCT(0x15c, struct __reg_PART_NUM)

/* symbolic names */

#define P_ATmega128RFA1                 131

#endif /* __ASSEMBLER__ */

  /* PART_NUM */

#define PART_NUM0                       0
#define PART_NUM1                       1
#define PART_NUM2                       2
#define PART_NUM3                       3
#define PART_NUM4                       4
#define PART_NUM5                       5
#define PART_NUM6                       6
#define PART_NUM7                       7

/* Device Identification Register (Version Number) */
#define VERSION_NUM                     _SFR_MEM8(0x15D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_VERSION_NUM {
        unsigned int version_num : 8;	/* Version Number */
};

#define VERSION_NUM_struct _SFR_MEM8_STRUCT(0x15d, struct __reg_VERSION_NUM)

/* symbolic names */

#define REV_A                           2
#define REV_B                           3

#endif /* __ASSEMBLER__ */

  /* VERSION_NUM */

#define VERSION_NUM0                    0
#define VERSION_NUM1                    1
#define VERSION_NUM2                    2
#define VERSION_NUM3                    3
#define VERSION_NUM4                    4
#define VERSION_NUM5                    5
#define VERSION_NUM6                    6
#define VERSION_NUM7                    7

/* Device Identification Register (Manufacture ID Low Byte) */
#define MAN_ID_0                        _SFR_MEM8(0x15E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_MAN_ID_0 {
        unsigned int man_id_0 : 8;	/* Manufacturer ID (Low Byte) */
};

#define MAN_ID_0_struct _SFR_MEM8_STRUCT(0x15e, struct __reg_MAN_ID_0)

/* symbolic names */

#define ATMEL_BYTE_0                    31

#endif /* __ASSEMBLER__ */

  /* MAN_ID_0 */

#define MAN_ID_00                       0
#define MAN_ID_01                       1
#define MAN_ID_02                       2
#define MAN_ID_03                       3
#define MAN_ID_04                       4
#define MAN_ID_05                       5
#define MAN_ID_06                       6
#define MAN_ID_07                       7

/* Device Identification Register (Manufacture ID High Byte) */
#define MAN_ID_1                        _SFR_MEM8(0x15F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_MAN_ID_1 {
        unsigned int man_id_1 : 8;	/* Manufacturer ID (High Byte) */
};

#define MAN_ID_1_struct _SFR_MEM8_STRUCT(0x15f, struct __reg_MAN_ID_1)

/* symbolic names */

#define ATMEL_BYTE_1                    0

#endif /* __ASSEMBLER__ */

  /* MAN_ID_1 */

#define MAN_ID_10                       0
#define MAN_ID_11                       1
#define MAN_ID_12                       2
#define MAN_ID_13                       3
#define MAN_ID_14                       4
#define MAN_ID_15                       5
#define MAN_ID_16                       6
#define MAN_ID_17                       7

/* Transceiver MAC Short Address Register (Low Byte) */
#define SHORT_ADDR_0                    _SFR_MEM8(0x160)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SHORT_ADDR_0 {
        unsigned int short_addr_0 : 8;	/* MAC Short Address */
};

#define SHORT_ADDR_0_struct _SFR_MEM8_STRUCT(0x160, struct __reg_SHORT_ADDR_0)

#endif /* __ASSEMBLER__ */

  /* SHORT_ADDR_0 */

#define SHORT_ADDR_00                   0
#define SHORT_ADDR_01                   1
#define SHORT_ADDR_02                   2
#define SHORT_ADDR_03                   3
#define SHORT_ADDR_04                   4
#define SHORT_ADDR_05                   5
#define SHORT_ADDR_06                   6
#define SHORT_ADDR_07                   7

/* Transceiver MAC Short Address Register (High Byte) */
#define SHORT_ADDR_1                    _SFR_MEM8(0x161)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_SHORT_ADDR_1 {
        unsigned int short_addr_1 : 8;	/* MAC Short Address */
};

#define SHORT_ADDR_1_struct _SFR_MEM8_STRUCT(0x161, struct __reg_SHORT_ADDR_1)

#endif /* __ASSEMBLER__ */

  /* SHORT_ADDR_1 */

#define SHORT_ADDR_10                   0
#define SHORT_ADDR_11                   1
#define SHORT_ADDR_12                   2
#define SHORT_ADDR_13                   3
#define SHORT_ADDR_14                   4
#define SHORT_ADDR_15                   5
#define SHORT_ADDR_16                   6
#define SHORT_ADDR_17                   7

/* Transceiver Personal Area Network ID Register (Low Byte) */
#define PAN_ID_0                        _SFR_MEM8(0x162)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PAN_ID_0 {
        unsigned int pan_id_0 : 8;	/* MAC Personal Area Network ID */
};

#define PAN_ID_0_struct _SFR_MEM8_STRUCT(0x162, struct __reg_PAN_ID_0)

#endif /* __ASSEMBLER__ */

  /* PAN_ID_0 */

#define PAN_ID_00                       0
#define PAN_ID_01                       1
#define PAN_ID_02                       2
#define PAN_ID_03                       3
#define PAN_ID_04                       4
#define PAN_ID_05                       5
#define PAN_ID_06                       6
#define PAN_ID_07                       7

/* Transceiver Personal Area Network ID Register (High Byte) */
#define PAN_ID_1                        _SFR_MEM8(0x163)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_PAN_ID_1 {
        unsigned int pan_id_1 : 8;	/* MAC Personal Area Network ID */
};

#define PAN_ID_1_struct _SFR_MEM8_STRUCT(0x163, struct __reg_PAN_ID_1)

