arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
#endif /* __ASSEMBLER__ */

  /* PAN_ID_1 */

#define PAN_ID_10                       0
#define PAN_ID_11                       1
#define PAN_ID_12                       2
#define PAN_ID_13                       3
#define PAN_ID_14                       4
#define PAN_ID_15                       5
#define PAN_ID_16                       6
#define PAN_ID_17                       7

/* Transceiver MAC IEEE Address Register 0 */
#define IEEE_ADDR_0                     _SFR_MEM8(0x164)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_0 {
        unsigned int ieee_addr_0 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_0_struct _SFR_MEM8_STRUCT(0x164, struct __reg_IEEE_ADDR_0)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_0 */

#define IEEE_ADDR_00                    0
#define IEEE_ADDR_01                    1
#define IEEE_ADDR_02                    2
#define IEEE_ADDR_03                    3
#define IEEE_ADDR_04                    4
#define IEEE_ADDR_05                    5
#define IEEE_ADDR_06                    6
#define IEEE_ADDR_07                    7

/* Transceiver MAC IEEE Address Register 1 */
#define IEEE_ADDR_1                     _SFR_MEM8(0x165)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_1 {
        unsigned int ieee_addr_1 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_1_struct _SFR_MEM8_STRUCT(0x165, struct __reg_IEEE_ADDR_1)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_1 */

#define IEEE_ADDR_10                    0
#define IEEE_ADDR_11                    1
#define IEEE_ADDR_12                    2
#define IEEE_ADDR_13                    3
#define IEEE_ADDR_14                    4
#define IEEE_ADDR_15                    5
#define IEEE_ADDR_16                    6
#define IEEE_ADDR_17                    7

/* Transceiver MAC IEEE Address Register 2 */
#define IEEE_ADDR_2                     _SFR_MEM8(0x166)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_2 {
        unsigned int ieee_addr_2 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_2_struct _SFR_MEM8_STRUCT(0x166, struct __reg_IEEE_ADDR_2)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_2 */

#define IEEE_ADDR_20                    0
#define IEEE_ADDR_21                    1
#define IEEE_ADDR_22                    2
#define IEEE_ADDR_23                    3
#define IEEE_ADDR_24                    4
#define IEEE_ADDR_25                    5
#define IEEE_ADDR_26                    6
#define IEEE_ADDR_27                    7

/* Transceiver MAC IEEE Address Register 3 */
#define IEEE_ADDR_3                     _SFR_MEM8(0x167)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_3 {
        unsigned int ieee_addr_3 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_3_struct _SFR_MEM8_STRUCT(0x167, struct __reg_IEEE_ADDR_3)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_3 */

#define IEEE_ADDR_30                    0
#define IEEE_ADDR_31                    1
#define IEEE_ADDR_32                    2
#define IEEE_ADDR_33                    3
#define IEEE_ADDR_34                    4
#define IEEE_ADDR_35                    5
#define IEEE_ADDR_36                    6
#define IEEE_ADDR_37                    7

/* Transceiver MAC IEEE Address Register 4 */
#define IEEE_ADDR_4                     _SFR_MEM8(0x168)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_4 {
        unsigned int ieee_addr_4 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_4_struct _SFR_MEM8_STRUCT(0x168, struct __reg_IEEE_ADDR_4)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_4 */

#define IEEE_ADDR_40                    0
#define IEEE_ADDR_41                    1
#define IEEE_ADDR_42                    2
#define IEEE_ADDR_43                    3
#define IEEE_ADDR_44                    4
#define IEEE_ADDR_45                    5
#define IEEE_ADDR_46                    6
#define IEEE_ADDR_47                    7

/* Transceiver MAC IEEE Address Register 5 */
#define IEEE_ADDR_5                     _SFR_MEM8(0x169)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_5 {
        unsigned int ieee_addr_5 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_5_struct _SFR_MEM8_STRUCT(0x169, struct __reg_IEEE_ADDR_5)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_5 */

#define IEEE_ADDR_50                    0
#define IEEE_ADDR_51                    1
#define IEEE_ADDR_52                    2
#define IEEE_ADDR_53                    3
#define IEEE_ADDR_54                    4
#define IEEE_ADDR_55                    5
#define IEEE_ADDR_56                    6
#define IEEE_ADDR_57                    7

/* Transceiver MAC IEEE Address Register 6 */
#define IEEE_ADDR_6                     _SFR_MEM8(0x16A)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_6 {
        unsigned int ieee_addr_6 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_6_struct _SFR_MEM8_STRUCT(0x16a, struct __reg_IEEE_ADDR_6)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_6 */

#define IEEE_ADDR_60                    0
#define IEEE_ADDR_61                    1
#define IEEE_ADDR_62                    2
#define IEEE_ADDR_63                    3
#define IEEE_ADDR_64                    4
#define IEEE_ADDR_65                    5
#define IEEE_ADDR_66                    6
#define IEEE_ADDR_67                    7

/* Transceiver MAC IEEE Address Register 7 */
#define IEEE_ADDR_7                     _SFR_MEM8(0x16B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_IEEE_ADDR_7 {
        unsigned int ieee_addr_7 : 8;	/* MAC IEEE Address */
};

#define IEEE_ADDR_7_struct _SFR_MEM8_STRUCT(0x16b, struct __reg_IEEE_ADDR_7)

#endif /* __ASSEMBLER__ */

  /* IEEE_ADDR_7 */

#define IEEE_ADDR_70                    0
#define IEEE_ADDR_71                    1
#define IEEE_ADDR_72                    2
#define IEEE_ADDR_73                    3
#define IEEE_ADDR_74                    4
#define IEEE_ADDR_75                    5
#define IEEE_ADDR_76                    6
#define IEEE_ADDR_77                    7

/* Transceiver Extended Operating Mode Control Register */
#define XAH_CTRL_0                      _SFR_MEM8(0x16C)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

