arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
struct __reg_XAH_CTRL_0 {
        unsigned int slotted_operation : 1;	/* Set Slotted Acknowledgment */
        unsigned int max_csma_retries : 3;	/* Maximum Number of CSMA-CA Procedure Repetition Attempts */
        unsigned int max_frame_retries : 4;	/* Maximum Number of Frame Re-transmission Attempts */
};

#define XAH_CTRL_0_struct _SFR_MEM8_STRUCT(0x16c, struct __reg_XAH_CTRL_0)

/* symbolic names */

#define SLOTTED_OP_DIS                  0
#define SLOTTED_OP_EN                   1

#endif /* __ASSEMBLER__ */

  /* XAH_CTRL_0 */

#define SLOTTED_OPERATION               0
#define MAX_CSMA_RETRIES0               1
#define MAX_CSMA_RETRIES1               2
#define MAX_CSMA_RETRIES2               3
#define MAX_FRAME_RETRIES0              4
#define MAX_FRAME_RETRIES1              5
#define MAX_FRAME_RETRIES2              6
#define MAX_FRAME_RETRIES3              7

/* Transceiver CSMA-CA Random Number Generator Seed Register */
#define CSMA_SEED_0                     _SFR_MEM8(0x16D)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_CSMA_SEED_0 {
        unsigned int csma_seed_0 : 8;	/* Seed Value for CSMA Random Number Generator */
};

#define CSMA_SEED_0_struct _SFR_MEM8_STRUCT(0x16d, struct __reg_CSMA_SEED_0)

#endif /* __ASSEMBLER__ */

  /* CSMA_SEED_0 */

#define CSMA_SEED_00                    0
#define CSMA_SEED_01                    1
#define CSMA_SEED_02                    2
#define CSMA_SEED_03                    3
#define CSMA_SEED_04                    4
#define CSMA_SEED_05                    5
#define CSMA_SEED_06                    6
#define CSMA_SEED_07                    7

/* Transceiver Acknowledgment Frame Control Register 2 */
#define CSMA_SEED_1                     _SFR_MEM8(0x16E)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_CSMA_SEED_1 {
        unsigned int csma_seed_1 : 3;	/* Seed Value for CSMA Random Number Generator */
        unsigned int aack_i_am_coord : 1;	/* Set Personal Area Network Coordinator */
        unsigned int aack_dis_ack : 1;	/* Disable Acknowledgment Frame Transmission */
        unsigned int aack_set_pd : 1;	/* Set Frame Pending Sub-field */
        unsigned int aack_fvn_mode : 2;	/* Acknowledgment Frame Filter Mode */
};

#define CSMA_SEED_1_struct _SFR_MEM8_STRUCT(0x16e, struct __reg_CSMA_SEED_1)

#endif /* __ASSEMBLER__ */

  /* CSMA_SEED_1 */

#define CSMA_SEED_10                    0
#define CSMA_SEED_11                    1
#define CSMA_SEED_12                    2
#define AACK_I_AM_COORD                 3
#define AACK_DIS_ACK                    4
#define AACK_SET_PD                     5
#define AACK_FVN_MODE0                  6
#define AACK_FVN_MODE1                  7

/* Transceiver CSMA-CA Back-off Exponent Control Register */
#define CSMA_BE                         _SFR_MEM8(0x16F)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_CSMA_BE {
        unsigned int min_be : 4;	/* Minimum Back-off Exponent */
        unsigned int max_be : 4;	/* Maximum Back-off Exponent */
};

#define CSMA_BE_struct _SFR_MEM8_STRUCT(0x16f, struct __reg_CSMA_BE)

#endif /* __ASSEMBLER__ */

  /* CSMA_BE */

#define MIN_BE0                         0
#define MIN_BE1                         1
#define MIN_BE2                         2
#define MIN_BE3                         3
#define MAX_BE0                         4
#define MAX_BE1                         5
#define MAX_BE2                         6
#define MAX_BE3                         7

/* Transceiver Digital Test Control Register */
#define TST_CTRL_DIGI                   _SFR_MEM8(0x176)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TST_CTRL_DIGI {
        unsigned int tst_ctrl_dig : 4;	/* Digital Test Controller Register */
        unsigned int : 4;
};

#define TST_CTRL_DIGI_struct _SFR_MEM8_STRUCT(0x176, struct __reg_TST_CTRL_DIGI)

#endif /* __ASSEMBLER__ */

  /* TST_CTRL_DIGI */

#define TST_CTRL_DIG0                   0
#define TST_CTRL_DIG1                   1
#define TST_CTRL_DIG2                   2
#define TST_CTRL_DIG3                   3

/* Transceiver Received Frame Length Register */
#define TST_RX_LENGTH                   _SFR_MEM8(0x17B)

#if !(defined(__ASSEMBLER__) || defined(__NOSTRUCT__))

struct __reg_TST_RX_LENGTH {
        unsigned int rx_length : 8;	/* Received Frame Length */
};

#define TST_RX_LENGTH_struct _SFR_MEM8_STRUCT(0x17b, struct __reg_TST_RX_LENGTH)

#endif /* __ASSEMBLER__ */

  /* TST_RX_LENGTH */

#define RX_LENGTH0                      0
#define RX_LENGTH1                      1
#define RX_LENGTH2                      2
#define RX_LENGTH3                      3
#define RX_LENGTH4                      4
#define RX_LENGTH5                      5
#define RX_LENGTH6                      6
#define RX_LENGTH7                      7

/* Start of frame buffer */
#define TRXFBST                         _SFR_MEM8(0x180)

  /* TRXFBST */

#define TRXFBST0                        0
#define TRXFBST1                        1
#define TRXFBST2                        2
#define TRXFBST3                        3
#define TRXFBST4                        4
#define TRXFBST5                        5
#define TRXFBST6                        6
#define TRXFBST7                        7

/* End of frame buffer */
#define TRXFBEND                        _SFR_MEM8(0x1FF)

  /* TRXFBEND */

#define TRXFBEND0                       0
#define TRXFBEND1                       1
#define TRXFBEND2                       2
#define TRXFBEND3                       3
#define TRXFBEND4                       4
#define TRXFBEND5                       5
#define TRXFBEND6                       6
#define TRXFBEND7                       7


/* Interrupt vectors */
/* Vector 0 is the reset vector */

#define _VECTORS_SIZE                  288

