arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom128rfa1.h
/* Timer/Counter5 Compare Match B */
#define TIMER5_COMPB_vect               _VECTOR(48)
#define TIMER5_COMPB_vect_num           48

/* Timer/Counter5 Compare Match C */
#define TIMER5_COMPC_vect               _VECTOR(49)
#define TIMER5_COMPC_vect_num           49

/* Timer/Counter5 Overflow */
#define TIMER5_OVF_vect                 _VECTOR(50)
#define TIMER5_OVF_vect_num             50

/* Vectors 51 through 56 are reserved (unimplemented UARTs) */

/* TRX24 - PLL lock interrupt */
#define TRX24_PLL_LOCK_vect             _VECTOR(57)
#define TRX24_PLL_LOCK_vect_num         57

/* TRX24 - PLL unlock interrupt */
#define TRX24_PLL_UNLOCK_vect           _VECTOR(58)
#define TRX24_PLL_UNLOCK_vect_num       58

/* TRX24 - Receive start interrupt */
#define TRX24_RX_START_vect             _VECTOR(59)
#define TRX24_RX_START_vect_num         59

/* TRX24 - RX_END interrupt */
#define TRX24_RX_END_vect               _VECTOR(60)
#define TRX24_RX_END_vect_num           60

/* TRX24 - CCA/ED done interrupt */
#define TRX24_CCA_ED_DONE_vect          _VECTOR(61)
#define TRX24_CCA_ED_DONE_vect_num      61

/* TRX24 - XAH - AMI */
#define TRX24_XAH_AMI_vect              _VECTOR(62)
#define TRX24_XAH_AMI_vect_num          62

/* TRX24 - TX_END interrupt */
#define TRX24_TX_END_vect               _VECTOR(63)
#define TRX24_TX_END_vect_num           63

/* TRX24 AWAKE - tranceiver is reaching state TRX_OFF */
#define TRX24_AWAKE_vect                _VECTOR(64)
#define TRX24_AWAKE_vect_num            64

/* Symbol counter - compare match 1 interrupt */
#define SCNT_CMP1_vect                  _VECTOR(65)
#define SCNT_CMP1_vect_num              65

/* Symbol counter - compare match 2 interrupt */
#define SCNT_CMP2_vect                  _VECTOR(66)
#define SCNT_CMP2_vect_num              66

/* Symbol counter - compare match 3 interrupt */
#define SCNT_CMP3_vect                  _VECTOR(67)
#define SCNT_CMP3_vect_num              67

/* Symbol counter - overflow interrupt */
#define SCNT_OVFL_vect                  _VECTOR(68)
#define SCNT_OVFL_vect_num              68

/* Symbol counter - backoff interrupt */
#define SCNT_BACKOFF_vect               _VECTOR(69)
#define SCNT_BACKOFF_vect_num           69

/* AES engine ready interrupt */
#define AES_READY_vect                  _VECTOR(70)
#define AES_READY_vect_num              70

/* Battery monitor indicates supply voltage below threshold */
#define BAT_LOW_vect                    _VECTOR(71)
#define BAT_LOW_vect_num                71


/* memory parameters */

#define SPM_PAGESIZE                    (256)
#define RAMSTART                        (0x200)
#define RAMSIZE                         (0x4000)
#define RAMEND                          (0x41FF)
#define XRAMSTART                       (0x0000)
#define XRAMSIZE                        (0x0000)
#define XRAMEND                         RAMEND
#define E2END                           (0xFFF)
#define E2PAGESIZE                      (0x08)
#define FLASHEND                        (0x1ffff)


/* Fuses */

#define FUSE_MEMORY_SIZE 3

/* LFUSE Byte */
#define FUSE_CKSEL0     ~_BV(0) /* Select Clock Source */
#define FUSE_CKSEL1     ~_BV(1) /* Select Clock Source */
#define FUSE_CKSEL2     ~_BV(2) /* Select Clock Source */
#define FUSE_CKSEL3     ~_BV(3) /* Select Clock Source */
#define FUSE_SUT0       ~_BV(4) /* Select start-up time */
#define FUSE_SUT1       ~_BV(5) /* Select start-up time */
#define FUSE_CKOUT      ~_BV(6) /* Clock output */
#define FUSE_CKDIV8     ~_BV(7) /* Divide clock by 8 */
#define LFUSE_DEFAULT (FUSE_CKSEL0 & FUSE_CKSEL2 & FUSE_CKSEL3 & FUSE_SUT0 & FUSE_SUT1 & FUSE_CKDIV8)

/* HFUSE Byte */
#define FUSE_BOOTRST    ~_BV(0) /* Select Reset Vector */
#define FUSE_BOOTSZ0    ~_BV(1) /* Select Boot Size */
#define FUSE_BOOTSZ1    ~_BV(2) /* Select Boot Size */
#define FUSE_EESAVE     ~_BV(3) /* EEPROM memory is preserved through chip erase */
#define FUSE_WDTON      ~_BV(4) /* Watchdog timer always on */
#define FUSE_SPIEN      ~_BV(5) /* Enable Serial programming and Data Downloading */
#define FUSE_JTAGEN     ~_BV(6) /* Enable JTAG */
#define FUSE_OCDEN      ~_BV(7) /* Enable OCD */
#define HFUSE_DEFAULT (FUSE_BOOTSZ0 & FUSE_BOOTSZ1 & FUSE_SPIEN & FUSE_JTAGEN)

/* EFUSE Byte */
#define FUSE_BODLEVEL0  ~_BV(0) /* Brown-out Detector trigger level */
#define FUSE_BODLEVEL1  ~_BV(1) /* Brown-out Detector trigger level */
#define FUSE_BODLEVEL2  ~_BV(2) /* Brown-out Detector trigger level */
#define EFUSE_DEFAULT (0xFF)



/* Lock Bits */

#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST
#define __LOCK_BITS_EXIST


/* Signature */

#define SIGNATURE_0 0x1E
#define SIGNATURE_1 0xA7
#define SIGNATURE_2 0x01

#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_PWR_SAVE (0x03<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)
#define SLEEP_MODE_EXT_STANDBY (0x07<<1)


#endif /* _AVR_IOM128RFA1_H_ */
